[
  {
    "id": "207168",
    "title": "DevOps Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/343F5C1EBB",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li> <strong>Kubernetes &amp; Containerization Expertise</strong> – You have several years of experience running containers in production, including building Kubernetes clusters from the ground up. You’re also experienced with managed Kubernetes services like AWS EKS, Azure AKS, or Google GKE.</li> <li> <strong>Infrastructure Auto-Scaling</strong> – You know how to leverage tools like the Horizontal Pod Autoscaler and Cluster Autoscaler to ensure seamless scaling and performance.</li> <li> <strong>Cloud Proficiency – </strong>You have hands-on experience with major cloud platforms like AWS, Microsoft Azure or GCP.</li> <li> <strong>Strong Networking &amp; Security Knowledge</strong> – You understand concepts like VPCs, subnets, internet gateways, and web security best practices.</li> <li> <strong>Passion for Automation</strong> – You have multiple years of experience with CI/CD systems (e.g., Jenkins, GitLab) and believe in automating whenever possible.</li> <li> <strong>Infrastructure as Code Enthusiast</strong> – You’re proficient with tools like Terraform, Helm, and Flux for managing infrastructure and deployments.</li> <li> <strong>Programming Skills</strong> – You have expertise in one or more programming languages such as Golang, Python, Ruby, JavaScript, Java, or Perl.</li> <li> <strong>Hands-on with Key Technologies</strong> – You’re familiar with Docker, Kubernetes, Message brokers, NoSQL and SQL databases and other core technologies.</li> <li> <strong>Monitoring &amp; Observability</strong> – You have experience with monitoring tools like Prometheus, Grafana, and the ELK Stack, ensuring system reliability and performance.</li> <li> <strong>Proactive &amp; Solution-Oriented Mindset</strong> – You anticipate scaling needs, take full ownership of challenges, and apply a systematic approach to problem-solving.</li> <li> <strong>Incident Response &amp; Decision Making</strong> – You stay calm under pressure, make decisions with urgency when necessary, and are comfortable being on call for emergencies.</li> <li> <strong>Team-Oriented &amp; Globally Minded</strong> – You’re eager to collaborate in an international, dynamic, and highly motivated team, contributing to the growth of Cognigy.AI.   </li> </ul>"
  },
  {
    "id": "215f6a",
    "title": "Engineering Manager",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/8E15EDA08A",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "requirements": "<p><strong>About you</strong></p><ul> <li> <strong>Proven Leadership Experience</strong> – You have a strong track record of leading and managing engineering teams, driving both technical excellence and team growth.</li> <li> <strong>Exceptional Communication Skills</strong> – You can articulate technical and non-technical concepts clearly, ensuring alignment across teams and stakeholders.</li> <li> <strong>Strong Conflict Resolution &amp; Feedback Culture</strong> – You handle challenges with diplomacy, foster open discussions, and create a culture where feedback is valued and constructive.</li> <li> <strong>Results-Driven &amp; Pragmatic</strong> – You focus on achieving impactful outcomes, balancing high standards with a practical, solution-oriented mindset.</li> <li> <strong>Thrives in Fast-Paced Environments</strong> – You excel in dynamic settings, adapting to shifting priorities while maintaining clarity and focus.</li> <li> <strong>Empathetic &amp; People-Centric</strong> – You genuinely care about your team’s well-being, fostering trust, collaboration, and a positive work environment.</li> <li> <strong>Supportive &amp; Team-Oriented</strong> – You know how to build a culture of trust, ensuring engineers feel empowered, supported, and motivated to do their best work.</li> <li> <strong>Personable &amp; Approachable</strong> – You enjoy engaging with people, building strong relationships, and creating a workplace where everyone feels valued.</li> </ul>"
  },
  {
    "id": "2e3f06",
    "title": "Senior Full-stack Software Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/90AF861F91",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li> <strong>Experienced Full-Stack Developer</strong> – Several years of hands-on experience in full-stack software development, building scalable and efficient applications.</li> <li> <strong>Containerization &amp; Debugging</strong> – Proficient in working with containers and debugging containerized applications.</li> <li> <strong>Linux Proficiency</strong> – Comfortable working in a Linux-based environment.</li> <li> <strong>Frontend Expertise</strong> – Strong experience with modern frontend frameworks such as React.js or Vue.js, including state management libraries like Redux and CSS-in-JS solutions.</li> <li> <strong>Backend Development</strong> – Skilled in building backend applications using frameworks like Node.js or Ruby on Rails.</li> <li> <strong>Design Mindset</strong> – A keen eye for good design and UI/UX principles—padding and margin aren’t just CSS properties to you.</li> <li> <strong>Database Knowledge</strong> – Familiarity with MongoDB or similar NoSQL databases; SQL experience is a plus.</li> <li> <strong>Real-Time Communication</strong> – Experience working with real-time communication protocols such as WebSocket or WebRTC.</li> <li> <strong>High-Quality Code &amp; Testing</strong> – Passion for writing clean, well-structured, and thoroughly tested code.</li> <li> <strong>Adaptable &amp; Growth-Oriented</strong> – Open to working with various programming languages and continuously learning new technologies.</li> <li> <strong>Strong Communicator</strong> – Ability to present new ideas and concepts clearly, including to management and stakeholders.</li> <li> <strong>Independent &amp; Collaborative</strong> – Capable of working autonomously while thriving in a team-oriented environment.</li> </ul>"
  },
  {
    "id": "2ee130",
    "title": "Sales Engineer",
    "department": "Sales Engineering (Presales)",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/1649C41173",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><p>Are you a tech-savvy professional with a knack for delivering captivating demos? Do you thrive in the world of enterprise software, especially in contact center or automation technologies? If so, we have an exciting opportunity for you!</p><p>Key Requirements:</p><ul> <li> <strong>Consulting &amp; Sales Engineering Expertise:</strong> Leverage your experience in roles like consultant, sales engineer, or presales to provide insightful and engaging demonstrations.</li> <li> <strong>Enterprise Software Proficiency:</strong> Bring your background in the enterprise software space, particularly with contact center or automation technologies, to the table.</li> <li> <strong>Programming Skills:</strong> Utilize your JavaScript programming/scripting experience, essential for presales and enablement services. Knowledge of Java, Python, or similar languages is a plus.</li> <li> <strong>Low Code &amp; Conversational AI Experience: </strong>Experience presenting conversational AI and generative AI technologies.</li> <li> <strong>Contact Center Knowledge: </strong>Understanding contact center technology (SIP and typical contact center components such as SBCs, ACD, ASR, TTS, etc.). Experience with conversation design, IVR design or chatbot design.</li> <li> <strong>Presentation Prowess:</strong> Be a confident and engaging presenter, capable of captivating your audience.</li> <li> <strong>Creative &amp; Design Skills:</strong> Experience with video editing, Photoshop, or similar tools is a valuable asset.</li> <li> <strong>Tech Enthusiast: </strong>Demonstrate confidence in speaking about and dealing with technology, with an ability to quickly learn new technologies.</li> <li> <strong>Technical Expertise:</strong> Have a deep understanding of Cognigy, conversational AI technologies, NLU/NLP, and related software technologies, including UI/UX.</li> <li> <strong>Sales Acumen:</strong> Effectively communicate complex technology in an easy-to-understand manner, build rapport with customers, and showcase Cognigy’s capabilities and value proposition.</li> <li> <strong>Communication &amp; Collaboration:</strong> Exhibit excellent communication skills, tailored to your audience, and the ability to collaborate effectively with cross-functional teams (<strong>Must be fluent in German and English)</strong> </li> </ul><p></p><p>If you’re ready to take on a role that combines technical knowledge with sales finesse, we’d love to hear from you!</p>"
  },
  {
    "id": "34466a",
    "title": "Senior Backend Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany",
      "Berlin, Berlin, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/FA3AB1C5D2",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li> <strong>Experienced Backend Engineer</strong> – You bring 5+ years of backend software development experience, building reliable and scalable systems in production environments.</li> <li> <strong>Container-Native</strong> – You’re comfortable working with containerized microservices, and debugging in Docker or similar environments is second nature.</li> <li> <strong>Linux Pro</strong> – You thrive in Linux-based environments and are at home in the terminal.</li> <li> <strong>Modern Backend Stack</strong> – Strong experience with Node.js and TypeScript. Bonus points if you’ve worked with Python or Golang — you're comfortable picking up new languages as needed.</li> <li> <strong>Database Fluent</strong> – Solid working knowledge of databases like MongoDB, PostgreSQL, and Redis, and understanding their strengths in different scenarios.</li> <li> <strong>Messaging Systems Familiarity</strong> – You’ve worked with message brokers like RabbitMQ, NATS, or similar tools to build distributed systems.</li> <li> <strong>Quality-Driven</strong> – Writing clean, well-tested, and maintainable code is a natural part of your workflow.</li> <li> <strong>Growth-Oriented</strong> – You’re curious and constantly learning, open to new technologies, tools, and ways of working.</li> <li> <strong>Proactive &amp; Impactful</strong> – You don’t just write code — you actively look for ways to improve systems, processes, and performance.</li> <li> <strong>Resilient &amp; Adaptable</strong> – You’re comfortable with ambiguity, stay focused under pressure, and adapt quickly as things evolve.</li> </ul>"
  },
  {
    "id": "37ddd6",
    "title": "Senior Backend Engineer (Voice)",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/D21D408C09",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you&nbsp;</strong></p><ul> <li> <strong>Experienced Backend Developer</strong> – You bring 5+ years of hands-on experience in backend software development, with a strong focus on building scalable, high-performance systems.</li> <li> <strong>Linux Native</strong> – Comfortable navigating and working in Linux-based environments; the terminal is your natural habitat.</li> <li> <strong>Real-Time Communication Know-How</strong> – You’ve built applications using WebRTC or SIP and understand the intricacies of real-time communication protocols. Experience with FreeSWITCH is a plus.</li> <li> <strong>Low-Level Programming Skills</strong> – You’re confident writing in low-level languages like C++, especially when performance and resource optimization are key.</li> <li> <strong>Modern Stack Proficiency</strong> – Experience with Node.js and TypeScript is a big plus. You follow clean code principles and value maintainability.</li> <li> <strong>Network Analysis Skills</strong> – You know how to monitor and analyze network traffic, particularly for SIP-based communication, and can troubleshoot complex issues.</li> <li> <strong>Database Versatility</strong> – You're familiar with relational and NoSQL databases like PostgreSQL, MongoDB, and Redis.</li> <li> <strong>Cloud Savvy</strong> – Exposure to cloud platforms, ideally Microsoft Azure or AWS, with an understanding of how to build and scale cloud-native apps.</li> <li> <strong>Curious &amp; Evolving</strong> – You're always learning, open to new languages and frameworks, and driven to improve your craft.</li> <li> <strong>Collaborative &amp; Communicative</strong> – Whether mentoring teammates or proposing technical solutions, you communicate clearly and work well across teams.</li> </ul>"
  },
  {
    "id": "3942cf",
    "title": "Senior Customer Success Manager",
    "department": "Customer Success",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/5B2018CFFE",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p> <strong>About you</strong></p><p> </p><ul> <li>At least <strong>5 years of experience in the software industry as a Customer Success Manager</strong>, with a proven track record of driving measurable business outcomes for customers, such as increased retention rates and product adoption.</li> <li>A deep understanding of what constitutes strategic business value in the <strong>software industry</strong>, including familiarity with industry benchmarks and the ability to guide customers in setting and achieving ROI-driven objectives</li> <li>Exceptional communication skills, both written and oral, with the ability to articulate complex solutions clearly to customers. Must be adept at building rapport and fostering collaborative relationships.</li> <li>Empathetic to customer needs with the ability to employ a user-centric approach to ensure a seamless customer experience.</li> <li>An analytical and structured approach to problem-solving, with experience using CRM platforms, Customer Success tools and data analysis software to prioritize and track value-driving activities.</li> <li>Openness to travel up to 30% of the time within Europe, including preparedness for occasional international conferences or meetings.</li> <li>A robust understanding of business and IT processes, particularly SaaS models, with a keen eye for identifying opportunities for process optimization.</li> <li><strong>Fluency in&nbsp;German and English&nbsp;is essential</strong></li> <li>A personal alignment with our company’s values and culture, contributing positively to our work environment.</li> <li>Motivated individual with a genuine interest in AI technology who is passionate about seeing AI used to generate business outcomes.</li> </ul><p> </p><p><strong>Growth Potential</strong></p><p>At Cognigy we are committed to your professional growth. This role offers significant opportunities for career development, including access to ongoing training, and involvement in high-impact projects allowing you to showcase and advance your unique skills and experience.</p>"
  },
  {
    "id": "39d00c",
    "title": "Staff Software Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/49728C082A",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul><ul> <li> <strong>Backend Engineer</strong> – With 8+ years of hands-on experience, you’ve built, scaled, and maintained backend systems that run reliably in production.</li> <li> <strong>Production-Grade Kubernetes Expertise</strong> – You’ve spent 5+ years deploying, running, and monitoring containerized applications in Kubernetes environments — you're deeply familiar with real-world operational challenges and how to solve them.</li> <li> <strong>Language-Agnostic Technologist</strong> – Whether it's TypeScript, Python, or Golang, you're fluent across multiple languages and, more importantly, you've mastered the underlying software engineering principles. Adopting a new language is just a matter of syntax.</li> <li> <strong>Deep Systems Knowledge</strong> – You're an expert in at least three of the following: MongoDB, Redis, PostgreSQL, RabbitMQ, NATS — and you know how to tune and optimize them for high-performance and stability in production.</li> <li> <strong>Testing Champion</strong> – You design and improve automated tests as an integral part of the development process, ensuring quality and confidence in every release.</li> <li> <strong>Ownership Mindset</strong> – You don’t just build features — you take full responsibility for what you ship, including fixing production issues whenever they arise. Reliability matters to you.</li> <li> <strong>Architectural Visionary</strong> – You’re capable of designing and evolving the architecture of large-scale product features. You can communicate your vision clearly to Product Managers and defend your design decisions with stakeholders.</li> <li> <strong>Strong Communicator &amp; Influencer</strong> – You bring ideas to life through clear, concise communication — whether presenting to leadership or collaborating with cross-functional teams, you can align others to your vision.</li> <li> <strong>Autonomous &amp; Impact-Oriented</strong> – You thrive in complex environments, working independently across multiple codebases, and consistently deliver high-quality, meaningful features that drive product value.<br><br><br><br>Sounds like you? Come and join us!</li> </ul></ul>"
  },
  {
    "id": "4200e4",
    "title": "Events Coordinator - Dallas, TX (Contract)",
    "department": "Marketing",
    "locations": [
      "Dallas, Texas, United States"
    ],
    "shortlink": "https://apply.workable.com/j/D01B3B6393",
    "positionType": "Not specified",
    "workplaceType": "hybrid",
    "requirements": "<p><strong>About you</strong></p><p></p><ul> <li>Bachelors degree in marketing, communications or related field</li> <li>3+ years in event marketing experience, preferably B2B and/or startups</li> <li>Strong project management and organizational skills with the ability to handle multiple events simultaneously, and stay within budget</li> <li>Strong communication skills</li> <li>Ability to think creatively and bring fresh ideas to the table</li> <li>Ability to analyze the success of events through data and metrics</li> <li>Experience with Hubspot, Asana and Linkedin a plus</li> <li>Willingness to travel when needed</li> </ul><p></p><p></p><p>This is a full-time, remote/in-office, temp-to-hire position with a 5-day (40 hours) workweek, starting with a 6-month contract. Office hours are typically from (9:00AM - 6:00 PM) from Monday to Friday.</p>"
  },
  {
    "id": "4200e6",
    "title": "Senior Channel Marketing Manager - US",
    "department": "Marketing",
    "locations": [
      "Dallas, Texas, United States"
    ],
    "shortlink": "https://apply.workable.com/j/F30DD0D763",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "requirements": "<p><strong>About you</strong></p><p></p><ul> <li>Bachelor's degree in marketing, communications, or a related field</li> <li>5+ years of experience in <strong>channel marketing</strong>, field marketing or related roles, within a <strong>SaaS or technology company</strong> </li> <li><strong>Strong understanding of channel sales, partner ecosystems, and go-to-market strategies</strong></li> <li>Proven experience in managing marketing budgets and executing marketing strategies</li> <li>Strong event planning and management skills, with experience coordinating tradeshows, webinars, and other partner events</li> <li>Proficiency in marketing analytics and data-driven decision-making</li> <li>Excellent communication and collaboration skills, with the ability to work effectively with cross-functional teams</li> <li><strong>Applicants must be authorized to work in the United States without the need for employer sponsorship now or in the future. We are unable to offer visa sponsorship for this position.</strong></li> </ul>"
  },
  {
    "id": "48bfd6",
    "title": "Solutions Architect - US",
    "department": "Professional Services",
    "locations": [
      "Plano, Texas, United States"
    ],
    "shortlink": "https://apply.workable.com/j/E26825D322",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "requirements": "<p><strong>Your new role – Solutions Architect – US</strong></p><p><strong>Location: Plano, Texas (Hybrid)</strong></p><p><strong>Potential OTE: $130 000 to $150 000 OTE (on-target earnings - base and bonus)</strong></p><p></p><p>As a Solutions Architect, you will design, build, and implement advanced Conversational AI solutions for our customers and partners. Acting as a highly experienced individual contributor, you will manage high-impact projects, provide deep technical insights, and ensure customers achieve maximum value from our platform.</p><p></p><p>Your responsibilities will include </p><ul> <li> <strong>Advanced Post-Sales Consulting &amp; Implementation: </strong>Drive complex projects from pilot/Proof of Concept (PoC) to full implementation, ensuring scalable and high-performance solutions for enterprise clients.</li> <li> <strong>Technical Expertise: </strong>Provide cutting-edge technical solutions, shape architectural best practices, and tackle advanced technical challenges with innovative approaches<strong>.</strong> </li> <li> <strong>Collaboration &amp; Support: </strong>Partner with cross-functional teams to support business development and contribute insights to enhance product strategies<strong>.</strong> </li> <li> <strong>Focused Enablement: </strong>Deliver technical training, workshops, and best practices to empower customers and partners with the knowledge needed for success<strong>.</strong> </li> <li> <strong>High-Impact Documentation: </strong>Develop precise technical documentation and ensure the resolution of complex technical issues to maintain high customer satisfaction. </li> </ul><p></p><p><strong>Growth Potential </strong></p><p></p><p>At Cognigy we are committed to your professional growth. This role offers significant opportunities for career development, including access to ongoing training, and involvement in high-impact projects allowing you to showcase and advance your unique skills and experience.</p><p> </p><p><strong>About you</strong></p><p> </p><ul> <li>Minimum of 5<strong> years in a similar role within Conversational AI, SaaS, or enterprise software industries</strong>, focusing on high-level individual contributions and advanced technical implementations.</li> <li>Proven experience with<strong> Cognigy or equivalent Conversational AI platforms</strong>.</li> <li>Demonstrated ability to resolve complex technical challenges with scalable and innovative solutions.</li> <li>Strong capability to align technical solutions with business objectives and deliver measurable outcomes.</li> <li>Exceptional ability to communicate technical concepts effectively to both technical and non-technical stakeholders.</li> <li><strong>Applicants must be authorized to work in the United States without the need for employer sponsorship now or in the future. We are unable to offer visa sponsorship for this position.</strong></li> </ul><p></p><p>Experience in the following fields is desired:</p><ul> <li>Reporting &amp; Metrics</li> <li>Proficient in JavaScript and other languages such as Python; experience with back-end integrations such as various data dips and API integrations.</li> <li>Front-End Design: Skilled in HTML and CSS design</li> <li>Back-End Development: Proficient in server-side applications, data manipulation and designing solutions.</li> </ul>"
  },
  {
    "id": "48c125",
    "title": "Senior Account Executive - US (NY, NJ, ME, RI, VT)",
    "department": "Direct Sales",
    "locations": [
      "New York, New York, United States",
      "New Jersey, United States",
      "Maine, United States",
      "Rhode Island, United States",
      "Vermont, United States"
    ],
    "shortlink": "https://apply.workable.com/j/4C5A5C01FE",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li>You have <strong>at least 5+ years of experience</strong> as an <strong>Enterprise Sales Executive</strong>, selling <strong>SaaS solutions</strong> to <strong>F500 enterprises.</strong> (CCaaS and/or CAI experience is beneficial)</li> <li>You have a <strong>track record of consistently exceeding $1M+ quotas </strong>and have <strong>closed 6- and 7-figure deals</strong> with Fortune 500 companies.</li> <li>You are comfortable navigating complex, multi-stakeholder sales cycles with SVP/C-level buyers.</li> <li>You thrive in a fast-paced, high-growth environment and have a <strong>hunter mentality </strong>and are relentless in winning new logos to drive business growth</li> <li>What is a salesperson without professional communication skills, and a customer-centric, personable demeanor?!</li> <li>You can balance driving a sales cycle independently while leveraging internal resources</li> <li>You are comfortable leveraging a partner channel to support the sales process</li> <li>Language skills: Spanish would be advantageous</li> <li><strong>Applicants must be authorized to work in the United States without the need for employer sponsorship now or in the future. We are unable to offer visa sponsorship for this position.</strong></li> </ul><p></p>"
  },
  {
    "id": "48c832",
    "title": "Senior Account Executive - US (MI, OK, IA, NE)",
    "department": "Direct Sales",
    "locations": [
      "United States",
      "Michigan, United States",
      "Oklahoma, United States",
      "Iowa, United States",
      "Nebraska, United States"
    ],
    "shortlink": "https://apply.workable.com/j/1192F0E593",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li>You have <strong>at least 5+ years of experience</strong> as an <strong>Enterprise Sales Executive</strong>, selling <strong>SaaS solutions</strong> to <strong>F500 enterprises.</strong> (CCaaS and/or CAI experience is beneficial)</li> <li>You have a <strong>track record of consistently exceeding $1M+ quotas </strong>and have <strong>closed 6- and 7-figure deals</strong> with Fortune 500 companies.</li> <li>You are comfortable navigating complex, multi-stakeholder sales cycles with SVP/C-level buyers.</li> <li>You thrive in a fast-paced, high-growth environment and have a <strong>hunter mentality </strong>and are relentless in winning new logos to drive business growth</li> <li>What is a salesperson without professional communication skills, and a customer-centric, personable demeanor?!</li> <li>You can balance driving a sales cycle independently while leveraging internal resources</li> <li>You are comfortable leveraging a partner channel to support the sales process</li> <li>Language skills: Spanish would be advantageous</li> <li><strong>Applicants must be authorized to work in the United States without the need for employer sponsorship now or in the future. We are unable to offer visa sponsorship for this position.</strong></li> </ul><p></p>"
  },
  {
    "id": "49ba49",
    "title": "Sales Engineer - US",
    "department": "Sales Engineering (Presales)",
    "locations": [
      "Dallas, Texas, United States"
    ],
    "shortlink": "https://apply.workable.com/j/A4D51C408E",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><p>Are you a tech-savvy professional with a knack for delivering captivating demos? Do you thrive in the world of enterprise software, especially in contact center or automation technologies? If so, we have an exciting opportunity for you!</p><p>Key Requirements:</p><ul> <li> <strong>Consulting &amp; Sales Engineering Expertise:</strong> Leverage your experience in roles like consultant, sales engineer, or presales to provide insightful and engaging demonstrations.</li> <li> <strong>Enterprise Software Proficiency:</strong> Bring your background in the enterprise software space, particularly with contact center or automation technologies, to the table.</li> <li> <strong>Programming Skills:</strong> Utilize your JavaScript programming/scripting experience, essential for presales and enablement services. Knowledge of Java, Python, or similar languages is a plus.</li> <li> <strong>Low Code &amp; Conversational AI Experience: </strong>Experience presenting conversational AI and generative AI technologies.</li> <li> <strong>Contact Center Knowledge: </strong>Understanding contact center technology (SIP and typical contact center components such as SBCs, ACD, ASR, TTS, etc.). Experience with conversation design, IVR design or chatbot design.</li> <li> <strong>Presentation Prowess:</strong> Be a confident and engaging presenter, capable of captivating your audience.</li> <li> <strong>Creative &amp; Design Skills:</strong> Experience with video editing, Photoshop, or similar tools is a valuable asset.</li> <li> <strong>Tech Enthusiast: </strong>Demonstrate confidence in speaking about and dealing with technology, with an ability to quickly learn new technologies.</li> <li> <strong>Technical Expertise:</strong> Have a deep understanding of Cognigy, conversational AI technologies, NLU/NLP, and related software technologies, including UI/UX.</li> <li> <strong>Sales Acumen:</strong> Effectively communicate complex technology in an easy-to-understand manner, build rapport with customers, and showcase Cognigy’s capabilities and value proposition.</li> <li> <strong>Communication &amp; Collaboration:</strong> Exhibit excellent communication skills, tailored to your audience, and the ability to collaborate effectively with cross-functional teams</li> <li><strong>Applicants must be authorized to work in the United States without the need for employer sponsorship now or in the future. We are unable to offer visa sponsorship for this position.</strong></li> </ul><p></p><p>If you’re ready to take on a role that combines technical knowledge with sales finesse, we’d love to hear from you!</p><p></p>"
  },
  {
    "id": "49c2dd",
    "title": "Software Engineer (DevEx)",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/A78669799E",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<h3>About you</h3><ul> <li> 5+ years of experience in backend software engineering, preferably in a platform or DevOps role </li> <li> Deep experience with <strong>Kubernetes</strong>, <strong>Helm</strong>, <strong>Terraform</strong>, and modern infrastructure-as-code practices </li> <li> Proficiency in <strong>backend development</strong> using <strong>TypeScript/Node.js</strong>, Python, or Golang </li> <li> Strong <strong>Linux terminal skills</strong> and experience with <strong>container debugging</strong> </li> <li> Familiarity with <strong>CI/CD systems</strong> (e.g., GitHub Actions, Jenkins) and pipeline optimization techniques </li> <li> Experience with security and compliance tooling like <strong>Snyk</strong>, <strong>Vanta</strong>, or equivalent </li> <li> Hands-on knowledge of cloud platforms (Azure, AWS preferred) </li> <li> Proven ability to collaborate, mentor, and lead process improvements across engineering teams </li> <li> Observability expertise (Grafana, Sentry, Kibana) and a systems-thinking mindset </li> <li> Comfortable making architectural decisions and owning secure, reliable developer infrastructure </li> </ul>"
  },
  {
    "id": "49c347",
    "title": "MLOps Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/1F4C0C60B7",
    "positionType": "Not specified",
    "workplaceType": "remote",
    "requirements": "<h3>About you</h3><ul> <li> Hands-on experience running production <strong>ML or LLM workloads in Kubernetes</strong> </li> <li> Familiarity with distributed ML frameworks such as <strong>KubeRay, Ray Serve, or similar</strong> </li> <li> Deep understanding of <strong>Kubernetes internals</strong>, especially GPU scheduling, autoscaling, and multi-tenant environments </li> <li> Proficiency with <strong>CI/CD systems for ML models</strong>, and versioned deployment strategies </li> <li> Strong experience with <strong>cloud platforms</strong> (AWS, GCP, or Azure), <strong>networking</strong>, and <strong>security</strong> best practices </li> <li> Skilled in <strong>monitoring and observability</strong> for ML workloads (e.g., Prometheus, Grafana) </li> <li> Passion for <strong>automation</strong>, <strong>performance tuning</strong>, and <strong>cost optimization</strong> for LLM workloads </li> <li> Clear communicator and proactive team player who thrives in fast-paced, cross-functional environments </li> <li> MLOps or DevOps certifications (nice to have)</li> </ul>"
  },
  {
    "id": "4a032d",
    "title": "Conversation Designer - US",
    "department": "Professional Services",
    "locations": [
      "Plano, Texas, United States"
    ],
    "shortlink": "https://apply.workable.com/j/BCFC45964C",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "requirements": "<p><strong>About You:</strong></p><ul> <li>3+ years of experience as a conversation designer, UX designer, or similar role </li> <li>Strong command of English (spoken and written) </li> <li>Proven experience creating user-centric conversational experiences across modalities </li> <li>Familiarity with conversational design tools (ideally Cognigy.AI) and &nbsp;experience utilizing Generative AI in conversation design</li> <li>You have a proven track-record of building great user experiences on different modalities</li> <li>You are enthusiastic about technology and familiar with current trends and hands-on experience enterprise software. (You don’t need to be programmer, but you should not be scared when you see code.)</li> <li>Comfortable working with APIs, data analysis, and understanding technical documentation </li> <li>A generalist mindset with adaptability and a passion for innovation </li> <li>Strong communication, collaboration, and problem-solving skills </li> <li>Customer-focused, solution-oriented, and skilled in navigating interpersonal dynamics</li> <li><strong>Applicants must be authorized to work in the United States without the need for employer sponsorship now or in the future. We are unable to offer visa sponsorship for this position.</strong></li> </ul>"
  },
  {
    "id": "4abfe2",
    "title": "Senior Project Manager - EMEA",
    "department": "Professional Services",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/B179C376BA",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "requirements": "<p><strong>About you</strong></p><ul> <li>At least 5 years of proven experience in end-to-end project management, with a strong track record of successfully delivering enterprise projects on time and within budget.</li> <li>Experience within professional services, consulting, or industries such as Contact Center operations and Conversational AI.</li> <li>Solid understanding of project management principles, methodologies, and tools. Familiarity with APIs and SaaS solutions is advantageous.</li> <li>Strong grasp of sales processes and business analysis, with the ability to align project goals with broader business objectives.</li> <li>Exceptional ability to manage multiple projects simultaneously with keen attention to detail.</li> <li>Proactive approach to identifying challenges and implementing innovative solutions.</li> <li>Strong interpersonal and communication abilities to build effective relationships with stakeholders at all levels.</li> <li>Expertise in project management software and tools.</li> <li><strong>Must be fluent in German (minimum C1 level) and English</strong></li> </ul><p></p>"
  },
  {
    "id": "4abfee",
    "title": "Senior Solutions Architect - EMEA",
    "department": "Professional Services",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/03BFB830E4",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li>Minimum of 5 years in a similar role within Conversational AI, SaaS, or enterprise software industries, focusing on high-level individual contributions and advanced technical implementations.</li> <li>Mastery in Python, Java, Node.js, APIs, SDKs, and cloud-based platforms. Proven experience with Cognigy or equivalent Conversational AI platforms.</li> <li>Demonstrated ability to resolve complex technical challenges with scalable and innovative solutions.</li> <li>Strong capability to align technical solutions with business objectives and deliver measurable outcomes.</li> <li>Exceptional ability to communicate technical concepts effectively to both technical and non-technical stakeholders.</li> <li><strong>Must be fluent in German (minimum C1 level) and English</strong></li> </ul><p></p>"
  },
  {
    "id": "4ac07a",
    "title": "Associate Solutions Architect - US",
    "department": "Professional Services",
    "locations": [
      "Plano, Texas, United States"
    ],
    "shortlink": "https://apply.workable.com/j/F27BA99687",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "requirements": "<p><strong>Your new role – Associate Solutions Architect – US</strong></p><p><strong>Location: Plano, Texas (Hybrid)</strong></p><p><strong>Potential OTE: $100 000 to $120 000 OTE (on-target earnings - base and bonus included)</strong></p><p></p><p>Are you passionate about Conversational AI and eager to grow your skills in a dynamic, customer-facing role? Join us as an <strong>Associate Solutions Architect</strong>, where you’ll help design, build, and implement innovative AI solutions that transform customer and partner experiences.</p><p>In this role, you'll contribute to impactful projects, deepen your technical expertise, and play a key part in delivering real value - while receiving the mentorship and support to continue building your career.</p><p>&nbsp;</p><p>Your responsibilities will include </p><ul> <li> <strong>Project Support &amp; Implementation: </strong>Assist in driving post-sales projects from pilot or Proof of Concept (PoC) through to implementation, helping deliver scalable and effective Conversational AI solutions under guidance from senior team members.</li> <li> <strong>Technical Solution Design: </strong>Collaborate on designing technical architectures and contributing to problem-solving efforts by applying best practices and learning cutting-edge techniques.</li> <li> <strong>Cross-Functional Collaboration: </strong>Work closely with experienced colleagues in product, engineering, and business development to support project success and provide valuable input based on your on-the-ground experience.</li> <li> <strong>Customer &amp; Partner Enablement: </strong>Contribute to technical workshops and training sessions that help customers and partners make the most of our platform.</li> <li> <strong>Documentation &amp; Support: </strong>Help develop and maintain clear technical documentation, and support the resolution of technical issues to ensure high levels of customer satisfaction.</li> </ul><p> </p><p><strong>Growth Potential </strong></p><p></p><p>At Cognigy we are committed to your professional growth. This role offers significant opportunities for career development, including access to ongoing training, and involvement in high-impact projects allowing you to showcase and advance your unique skills and experience.</p><p> </p><p><strong>About you</strong></p><p> </p><ul> <li>Minimum of 1-2 years in a similar role within Conversational AI, SaaS, or enterprise software industries, focusing on high-level individual contributions and advanced technical implementations.</li> <li>Experience with Cognigy or equivalent Conversational AI platforms.</li> <li>Demonstrated ability to resolve complex technical challenges with scalable and innovative solutions.</li> <li>Strong capability to align technical solutions with business objectives and deliver measurable outcomes.</li> <li>Ability to communicate technical concepts effectively to both technical and non-technical stakeholders.</li> <li><strong>Applicants must be authorized to work in the United States without the need for employer sponsorship now or in the future. We are unable to offer visa sponsorship for this position.</strong></li> </ul><p></p><p>Experience in the following fields is desired:</p><ul> <li>Reporting &amp; Metrics</li> <li>Proficient in JavaScript and other languages such as Python; experience with back-end integrations such as various data dips and API integrations.</li> <li>Front-End Design: Skilled in HTML and CSS design</li> <li>Back-End Development: Proficient in server-side applications, data manipulation and designing solutions.</li> </ul>"
  },
  {
    "id": "4b7daa",
    "title": "Product Manager",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/A805BEFF6E",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<h3>About you</h3><ul> <li> Proven experience as a Product Manager with a strong track record of delivering successful B2B SaaS products </li> <li> Comfortable operating in fast-paced, evolving markets — ideally within AI, customer experience, or enterprise software </li> <li> Strategic thinker who thrives in ambiguous environments and knows how to prioritize for business outcomes </li> <li> Skilled at turning complex technical and business requirements into clear product plans </li> <li> Experienced in customer interviews, stakeholder alignment, and competitive analysis </li> <li> Deep understanding of agile product development and product discovery best practices </li> <li> Strong communicator with the ability to work cross-functionally and influence without authority </li> <li> Familiarity with tools such as Jira, Confluence, Figma, Productboard, Amplitude, or similar </li> <li> Fluent in English (German is a plus, but not required)</li> </ul>"
  }
]