[
  {
    "id": "201d8e",
    "title": "Business Development Representative - UK",
    "department": "Sales",
    "locations": [
      "Berlin, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/33587C5EED",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Location</strong>: Berlin or Düsseldorf, Germany<br></p><p><strong>Cognigy</strong> </p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount growth of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our team.</p><p><strong>Team</strong><br></p><p>The BDR team belongs to the Revenue team, which includes Marketing, Sales and Customer Success, is a high energy group that loves evangelizing and delivering industry-leading business solutions to both new and existing customers. The primary objectives of the global BDR team is to generate a pipeline for new, quality sales opportunities, land new customers and expand business within our existing customers.</p><p>You get the opportunity to experience a steep learning curve, because we coach and support you in matters of enterprise software sales.</p><p><strong>Your tasks</strong></p><ul> <li>As a BDR you will work closely with our sales manager / sales team and support the strategic development of a portfolio with target customers</li> <li>Outbound prospecting via phone, email and social as well as qualifying inbound &amp; outbound leads</li> <li>You maintain data in our CRM (Hubspot) so that we have conclusive data from our prospects</li> <li>You conduct initial discussions and give product demos to potential customers</li> <li>You represent Cognigy at trade fairs and conferences</li> </ul>",
    "requirements": "<ul> <li>Initial work experience as a Business Development Representative, Sales Development Representative or similar role</li> <li>Hands-on experience with multiple sales techniques (including cold calls)</li> <li>Ideally experience with CRM software (e.g. Hubspot)</li> <li>Motivated to work in Software Sales</li> <li>Excellent communication and negotiation skills</li> <li>Ability to deliver engaging presentations</li> <li><strong>Fluency in English</strong></li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from the office in Düsseldorf or remote in Germany</li> </ul><p><br></p><p><br></p>"
  },
  {
    "id": "204090",
    "title": "Senior Manager Enablement Services",
    "department": "Sales",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/57BF588E30",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p>Manages and enables a team of solution architects and tech consultants with the goal of providing expert consulting, best-practices and strategic advice to customers, partners, and other stakeholders. This includes monitoring and supervising the team, providing guidance, instructions, training, and leadership skills to inspire the team to perform at their optimum. Further activities include the regular alignment with Customer Success Management, Global Support, Sales Engineering and Product (Marketing) teams and might include occasional customer-facing meetings and interactions. The Consulting Director is a thought-leader when it comes to large scale rollouts of conversational AI projects and might occasionally participate in webinars or other related events. </p><p><br></p>",
    "requirements": "<p>- managing a team</p>",
    "benefits": ""
  },
  {
    "id": "206d1e",
    "title": "Sr. Backend (Node.js) Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/884F2C8017",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Job location</strong>: Germany, Remote or in our Düsseldorf HQ</p><p><strong>Cognigy</strong><br></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our engineering team.</p><p><strong>Your challenge:<br></strong></p><ul> <li>Producing a clean, readable and well-tested code</li> <li>Improvement and testing of already existing code and documentation</li> <li>Helping us to increase unit-testing coverage for existing code</li> <li>Profiling and benchmarking our existing codebase to identify bottlenecks</li> <li>Measuring the performance of database-queries and helping us to reduce network overhead in our microservices-based product-architecture</li> </ul>",
    "requirements": "<ul> <li>Several years of experience in backend development (ideally in Node.JS/ Typescript)</li> <li>Several years of experience with MongoDB or a similar NoSQL database including expertise in profiling database queries</li> <li>Experience with containers and debugging containerized applications</li> <li>Experience in building a large-scale software product</li> <li>Experience with writing well-tested and high-quality code - we are practicing TDD using testing frameworks and libraries like Mocha, Chai &amp; sinon</li> <li>Experience in identifying bottlenecks in a large codebase by using a profiler and a debugger</li> <li>Familiar with code-analysis tools and the procedure of static code analysis</li> <li>Experience in using and working in a Linux-based environment daily – you should be comfortable with working in the terminal</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home/ remote in Germany</li> </ul><p><br></p><p>#LI-Remote </p>"
  },
  {
    "id": "206d24",
    "title": "Sr. Enterprise Account Executive - DACH",
    "department": "Sales",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/670BAC682C",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.</p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our sales team.</p><p><strong><br>Your job:</strong><br></p><p>To reinvent an industry, we are building out the best team. <strong>That’s why we are looking for you</strong> as a <strong>Sr. Entreprise Account Executive </strong>at Cognigy. As an Account Executive you will work closely with our prospective customers to understand their challenges and goals and identify how Cognigy can help them.<br></p><p><br></p><p><strong>Responsibilities:  </strong></p><ul> <li>You are responsible for acquiring new entreprise companies from all industries in the DACH region and you position our leading Conversational.AI platform (SaaS + On-Premise).</li> <li>You are responsible for the full sales cycle, the processing of tendering processes and you take on the overall responsibility for complex contract negotiations with the decision-makers at management level (C-Level)</li> <li>You are responsible for the implementation of web demos and customer meetings on site as well as the independent and professional preparation of discussions with customer-specific product presentations</li> <li>You will be working closely with your Presales Consultants and your Business Development Representative</li> <li>You act as a Trusted Advisor to your prospective customers at any time during the sales cycle</li> <li>You represent Cognigy at trade fairs or events that are customary in the industry</li> <li>The continuous optimization of the cooperation with customers through up- and cross-selling is your responsibility</li> <li>You will help shape our product roadmap and the permanent refreshment of product knowledge</li> </ul>",
    "requirements": "<ul> <li>You have at least 3-5 years of enterprise sales experience, preferably in the areas of software solutions, online marketing solutions or web content management</li> <li>You can present yourself confidently and empathetically at all management levels (including C-Level)</li> <li>You have strong entrepreneurial skills and have a high affinity for customer acquisition</li> <li>In addition to direct sales, you are also used to acquire new customers together with our partners and supporting them in the sales process. </li> <li>You shine through your professional communication and negotiation skills as well as your customer-oriented and personable demeanor</li> <li>You work in a very structured, organized manner and you know how to prioritize</li> <li>Fluent German and very good English skills complete your profile</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization </li> <li>Flexible working hours and ability to work from home/ remote in Germany</li> </ul><p><br></p><p>#LI-Remote </p>"
  },
  {
    "id": "206d34",
    "title": "Sales Engineer - DACH",
    "department": "Sales",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/17D08BE5F6",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.</p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our sales engineering team.</p><p>The ideal candidate for the Sales Engineering role is comfortable working with a <strong>broad range of technologies</strong> and can project confidence in Cognigy's ability to address <strong>customer requirements</strong>.</p><p>Key requirements are <strong>confidence in speaking and dealing with technology</strong> and an <strong>ability to pick up new technologies quickly.</strong></p><p>You don’t need to understand all technologies (i.e. Conversational AI, Node.js, React, Javascript) and applications in-depth, but you should be excited about encountering a new API and figuring out how to weave it into a customized demo for enterprise customers.</p><p>You should understand what makes Cognigy valuable to its customers and incorporate that messaging into custom product demonstrations.</p><p>The ideal candidate will have experience in the enterprise software space working with contact center or automation technologies, either at software companies or building custom solutions.</p><p>You will spend a large part of your time <strong>building great Cognigy.AI demos</strong>. You are not afraid of dealing with Node.JS or <strong>React-based front ends to give your chatbot demos the necessary shine</strong>.</p><p>You will work closely with our sales team on <strong>discovery calls</strong>, <strong>technical deep-dives</strong> and <strong>product demonstrations</strong>.</p><p>In sum, the ideal candidate is a people person who loves technology, enjoys learning new things and gets energy from sharing their knowledge with prospective customers.</p>",
    "requirements": "<ul> <li>Experience as a consultant, sales engineer or comparable role that involves technical advice and providing fun and engaging demos. </li> <li>Programming / scripting experience in JavaScript, Java, Python or similar. You don't necessarily need tons of development experience.</li> <li>Low code platform experience and conversational AI is a plus: Salesforce, Mendix, Outsystems, ServiceNow and/or others</li> <li>You are a confident and engaging presentor</li> <li>Creative &amp; design skills (maybe you have experience with video editing, Photoshop or similar). A sales engineering role is all about creating a great experience for our customers</li> <li>German &amp; English language skills</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from the office in Düsseldorf or remote in the UK/Germany</li> </ul><p><br></p><p>#LI-Remote </p>"
  },
  {
    "id": "206d45",
    "title": "Sales Engineer - UK",
    "department": "Sales",
    "locations": [
      "London, United Kingdom"
    ],
    "shortlink": "https://apply.workable.com/j/2E79731EA8",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>About Cognigy</strong></p>  <p>Cognigy, a market leader in Conversational AI, powers up enterprise contact centers to exceed customer expectations, improve agent satisfaction and rapidly respond to market changes. The Cognigy.AI platform enables next-generation customer service, with a suite of solutions including Conversational IVR, Smart Self-Service, and Agent + Assist. Cognigy.AI gives the enterprise what it needs to deliver always-on, personalized service experiences at scale, on both voice and chat.</p>    Our skilled #CognigyCrew are the people behind our cutting-edge technology and we are now looking for more talented people to join our global team.<p><br></p><p><strong>Why you’ll love working at Cognigy: our promise to you</strong></p>  <p>We empower our people to be successful as part of a diverse, passionate and respectful team who are proud to be enabling customer and employee service that is loved by everyone.</p>    <p>We do this by challenging each other to succeed and being enabled to do our best work. Encouraging and supporting growth is at the heart of our success, founded on a culture of mutual respect and trust – always! It’s no wonder that the values that inspire and drive our #CognigyCrew are our 4Ts: </p>  <p><strong>Team</strong>, <strong>Trust</strong>, <strong>Transparency</strong>, <strong>Technology</strong>.</p><p><br></p><p><strong>Your new role</strong></p>  <p>As a member of our presales team, reporting into the Director of Consulting, you will work closely with our sales team on discovery calls, technical deep dives and product demonstrations. A sales engineering role is all about creating a great experience for our customers.</p>    <p>Your responsibilities will include: </p>  <ul> <li>Supporting the sales team with solution selling into enterprise customers</li> <li>Partnering with the sales team to plan, prepare and execute on strategic deals within the sales cycle</li> <li>Participating in discovery calls and technical deep dives </li> <li>Creating and delivering powerful presentations and customised product demonstrations</li> <li>Clearly communicating and presenting what makes Cognigy valuable to our customers</li> <li>Collaborating with relevant stakeholders to communicate customer requirements and further enhancement</li> </ul>",
    "requirements": "<p><strong>About you</strong></p>  <p>You are a passionate, people person with a love for technology, enjoys learning new things and gets energy from sharing their knowledge with prospective customers.</p>    <p>You will have: </p>  <ul> <li>Experience as a consultant, sales engineer or comparable role that involves technical advice and providing fun and engaging demos.</li> <li>Programming / scripting experience in JavaScript, Java, Python or similar. You don’t need to understand all technologies and applications in-depth, but you should be excited about encountering a new API and figuring out how to weave it into a customized demo for enterprise customers.</li> <li>Experience in the enterprise software space working with contact center or automation technologies, either at software companies or building custom solutions.</li> <li>Low code platform experience and conversational AI is a plus.</li> <li>You are a confident and engaging presenter.</li> <li>Creative &amp; design skills (maybe you have experience with video editing, Photoshop or similar). </li> <li>Confidence in speaking and dealing with technology and an ability to pick up new technologies quickly.</li> </ul>                  <p>Sound like you? Come and join us!</p>",
    "benefits": "<p><strong>Life at Cognigy: what   we offer you</strong></p>   <p>We are an ambitious and international tech company with a great culture, and we make sure that everyone   feels welcome. Our excellent benefits make us a fantastic place to work -   these include:</p><ul> <li>Attractive and performance-oriented salary</li> <li>Company pension plan </li> <li>Discretionary virtual stock options plan, so you can benefit from the company’s success</li> <li>Unique opportunity to help build and shape the company, with little hierarchy </li> <li>Flexible and remote working options</li> <li>Colleague recognition, reward and celebration events</li> <li>Global Employee Assistance Program</li> <li>ClassPass membership, giving you access to a variety of fitness and wellness experiences</li> <li>Ongoing learning and development opportunities, including LinkedIn Learning</li> </ul>"
  },
  {
    "id": "206d49",
    "title": "Sales Engineer - Benelux",
    "department": "Sales",
    "locations": [
      "Amsterdam, Netherlands"
    ],
    "shortlink": "https://apply.workable.com/j/3FADBAE060",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Job location: </strong></p><p><em>Role can be based out of the Netherlands, but you will be contracted to our German entity (Cognigy GmbH)</em></p><p></p><p><strong>Cognigy</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.</p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our sales engineering team.</p><p>The ideal candidate for the Sales Engineering role is comfortable working with a broad range of technologies and can project confidence in Cognigy's ability to address customer requirements.<br></p><p>Key requirements are <strong>confidence in speaking</strong> and <strong>dealing with technology</strong> and an <strong>ability to pick up new technologies quickly</strong>.</p><p>You don’t need to understand all technologies (i.e. Conversational AI, Node.js, React, Javascript) and applications in-depth, but you should be excited about encountering a new API and figuring out how to weave it into a customized demo for enterprise customers. You should understand what makes Cognigy valuable to its customers and incorporate that messaging into custom product demonstrations.</p><p>The ideal candidate will have experience in the enterprise software space working with contact center or automation technologies, either at software companies or building custom solutions.</p><p>You will spend a large part of your time <strong>building great Cognigy.AI demos</strong>. You are not afraid of dealing with Node.JS or <strong>React-based front ends</strong> to give your chatbot demos the necessary shine.</p><p>You will work closely with our sales team on <strong>discovery calls</strong>, <strong>technical deep-dives</strong> and <strong>product demonstrations</strong>.</p><p>In sum, the ideal candidate is a people person who loves technology, enjoys learning new things and gets energy from sharing their knowledge with prospective customers.</p>",
    "requirements": "<ul> <li>Experience as a consultant, sales engineer or comparable role that involves technical advice and providing fun and engaging demos.</li> <li>Programming / scripting experience in JavaScript, Java, Python or similar. You don't necessarily need tons of development experience.</li> <li>Low code platform experience and conversational AI is a plus: Salesforce, Mendix, Outsystems, ServiceNow and/or others</li> <li>You are a confident and engaging presentor</li> <li>Creative &amp; design skills (maybe you have experience with video editing, Photoshop or similar). A sales engineering role is all about creating a great experience for our customers</li> <li>English &amp; <strong>Dutch </strong>language skills</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from the office in Düsseldorf or remote in the Netherlands</li> </ul>"
  },
  {
    "id": "206d54",
    "title": "Sales Engineer - UAE",
    "department": "Sales",
    "locations": [
      "Dubai, United Arab Emirates"
    ],
    "shortlink": "https://apply.workable.com/j/D7056A3A0F",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $59M.</p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our sales engineering team.</p><p><strong>The role</strong></p><p>The ideal candidate for the Sales Engineering role is comfortable working with a <strong>broad range of technologies</strong> and can project confidence in Cognigy's ability to address <strong>customer requirements</strong>.<br></p><p>Key requirements are <strong>confidence in speaking</strong> and <strong>dealing with technology</strong> and an <strong>ability to pick up new technologies quickly</strong>.</p><p>You don’t need to understand all technologies (i.e. Conversational AI, Node.js, React, Javascript) and applications in-depth, but you should be excited about encountering a new API and figuring out how to weave it into a customized demo for enterprise customers.</p><p>You should understand what makes Cognigy valuable to its customers and incorporate that messaging into custom product demonstrations.</p><p>The ideal candidate will have experience in the enterprise software space working with contact center or automation technologies, either at software companies or building custom solutions.</p><p>You will spend a large part of your time <strong>building great Cognigy.AI demos</strong>. You are not afraid of dealing with Node.JS or <strong>React-based front ends</strong> to give your chatbot demos the necessary shine.</p><p>You will work closely with our sales team on discovery calls, <strong>technical deep-dives</strong> and product demonstrations.</p><p>In sum, the ideal candidate is a people person who loves technology, enjoys learning new things and gets energy from sharing their knowledge with prospective customers.</p>",
    "requirements": "<ul> <li>Experience as a consultant, sales engineer or comparable role that involves technical advice and providing fun and engaging demos.</li> <li>Programming / scripting experience in JavaScript, Java, Python or similar. You don't necessarily need tons of development experience.</li> <li>Low code platform experience and conversational AI is a plus: Salesforce, Mendix, Outsystems, ServiceNow and/or others</li> <li>You are a confident and engaging presentor</li> <li>Creative &amp; design skills (maybe you have experience with video editing, Photoshop or similar). A sales engineering role is all about creating a great experience for our customers</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home/ remote in Dubai</li> </ul>"
  },
  {
    "id": "206d66",
    "title": "Solution Engineer",
    "department": "Sales",
    "locations": [
      "Boston, United States"
    ],
    "shortlink": "https://apply.workable.com/j/9D9211662B",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong> </p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our consulting team.</p><p><strong>The role:</strong><br></p><p>Looking for a new challenge on the cutting-edge of technology? Interested in chatbots, voice devices and automation? Come join us!</p><p>We are looking for a Solution Engineer/Architect to join our Consulting team of product experts who work with our clients and partners to build innovative Conversational AI implementations.</p><p>You will be the <strong>go-to person for technical questions</strong> about our conversational AI platform and <strong>will be involved with the project from start to finish</strong>. This means that <strong>you are involved with the requirements gathering</strong> as well as <strong>actual development</strong> and y<strong>ou have a talent for translating customer demands to concrete technical solutions</strong>.</p><p>You will be working with Cognigy.AI integration partners like Deloitte, Accenture or Codecentric in larger implementation projects.<br></p>",
    "requirements": "<ul> <li>You have at least a first professional experience in a similar working environment</li> <li>You are a team player and love to talk to customers and partners</li> <li>You are hands-on with technologies like Node.JS</li> <li>You are able to find solutions to the most complex technical requirements and love implementing them</li> <li>You are self-motivated, pro-active and capable of structuring your work in order to deliver</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome  </li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization </li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers </li> <li>We also offer you an attractive and performance-oriented salary </li> <li>Great benefits, including health/dental/vision and 401k </li> <li>Flexible working hours and ability to work from home in the US</li> </ul><p>#LI-Remote </p>"
  },
  {
    "id": "207150",
    "title": "Backend Engineer",
    "department": "Engineering",
    "locations": [
      "Málaga, Spain"
    ],
    "shortlink": "https://apply.workable.com/j/22518899E0",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "207151",
    "title": "Frontend Engineer",
    "department": "Engineering",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/5B78BD6D81",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "<p>Test</p>",
    "requirements": "<p>Test</p>",
    "benefits": "<p>Test</p>"
  },
  {
    "id": "207155",
    "title": "Frontend Engineer",
    "department": "Engineering",
    "locations": [
      "Málaga, Spain"
    ],
    "shortlink": "https://apply.workable.com/j/B134AAB025",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "207168",
    "title": "DevOps Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/343F5C1EBB",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>About you</strong></p><p>Cognigy is revolutionizing the customer service industry by harnessing the most cutting-edge AI technology on the market. Its award-winning solution Cognigy.AI, empowers businesses to deliver exceptional customer service that is instant, personalized, in any language and on any channel. Cognigy is shaping the future of customer service, creating AI Agents by perfectly combining Generative and Conversational AI to increase customer satisfaction and actively support employees in real-time.  </p><p>Our skilled #CognigyCrew are the people behind our cutting-edge technology and we are now looking for more talented people to join our global team.</p><p></p><p><strong>Why you’ll love working at Cognigy: our promise to you</strong></p><p>We empower our people to be successful as part of a diverse, passionate and respectful team who are proud to be leading the automation of conversations to make life easier for everyone.</p><p>We do this by challenging each other to succeed and being enabled to do our best work. Encouraging and supporting growth is at the heart of our success, founded on a culture of mutual respect and trust – always! It’s no wonder that the values that inspire and drive our #CognigyCrew are our 4Ts:</p><p><strong>Team, Trust, Transparency, Technology.</strong></p><p></p><p><strong>Your new role</strong></p><p>You will be welcomed into our engineering department, which is divided into cross-functional, verticalized development teams, who are focused on delivering continuous improvements, features and developing new products. To support the delivery process and stability of our products, we can also count on our Product Support team, QA team, and SRE team who, alongside our Product and People team, Director/Architect and VP Engineering, are constantly looking to overcome new challenges, to innovate, and to ensure the success of our products and satisfaction of our customers.</p><p></p><p><strong>Your mission</strong></p><ul> <li>Automating provisioning processes of Kubernetes clusters as well as our microservices based software application Cognigy.AI</li> <li>Monitoring product installations and our infrastructure to guarantee the stability of our SaaS product offerings</li> <li>Helping our engineering teams to automate reoccurring procedures to increase efficiency and reduce costs</li> <li>Providing guidance to other DevOps engineers</li> <li>Holistic approach: As part of an agile development team, you will be involved in all phases of software engineering - from inception to coding, testing, delivery, and operation. You enable a high degree of automation on every level</li> <li>Performance mindset: Your mission will be to increase productivity of development teams by focusing on the cross-functional aspects like observability, scalability, availability, maintainability, reliability, etc, while always keeping the customer in mind. In doing so, you will also be leading postmortems after major incidents.</li> <li>Continuous learning: You are willing to continuously develop yourself, eager to share your knowledge and take over responsibility, and have fun doing so</li> <li>Customer feedback: As part of the team you constantly seek out feedback from users while developing new features and always keep the code base deployable to production</li> </ul>",
    "requirements": "<p><strong>About you</strong></p><ul> <li>Several years of experience in Kubernetes and running containers in production, including building Kubernetes clusters from the ground up</li> <li>Being available in case of emergencies is not a problem for you</li> <li>Experience in running distributed systems like databases</li> <li>Good networking knowledge: Like VPC, Subnets, Internet Gateways</li> <li>Multiple years of experience with CI/CD systems like Jenkins – you love to automate whenever you can</li> <li>Experience with automation tools: Terraform, Helm and Flux</li> <li>Excellent communication skills in English</li> <li>Proficiency in German at a minimum C1 level – we have many German customers who need help with DevOps related questions</li> </ul><p></p><p><strong>Desirable skills and experiences</strong></p><ul> <li>Knowledge in auto-scaling infrastructure by leveraging tools like the Horizontal Pod Autoscaler or the Cluster Autoscaler</li> <li>You have used products like AWS EKS, Azure AKS or Google GKE – the managed Kubernetes services from leading cloud providers</li> <li>You can use “the force” to proactively scale our infrastructure</li> <li>You have expertise in coding with one or more of the following languages: Golang, Python, Ruby, JavaScript, Java or Perl.</li> <li>You have also experience with cloud platforms (e.g. Google Cloud Platform, Amazon Web Services, Microsoft Azure).</li> <li>You are familar with topics like Docker, Kubernetes, Elasticsearch, Cassandra, Postgres, Kafka, Jenkings, Gitlab</li> <li>Basic knowledge of monitoring and experience with Datadog, Prometheus, Grafana, ELK-Stack or similar tools</li> <li>Expertise around web security and networking</li> <li>Your mindset: You have a systematic problem-solving approach, coupled with a strong sense of ownership and drive.</li> <li>You have experience in dealing with difficult situations and you can make, when necessary, decisions with a sense of urgency</li> <li>Last but not least: You want to work in an international, dynamic and highly motivated team and want to contribute the development of Cognigy.AI</li> </ul>",
    "benefits": "<p><strong>Life at Cognigy: what we offer you</strong></p><p>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome. Our excellent benefits make us a fantastic place to work - these include:</p><ul> <li>Attractive and performance-oriented salary</li> <li>Company Pension Scheme</li> <li>25 days paid leave, plus 5 floating days, plus public holidays</li> <li>Unique opportunity to help build and shape the company, with little hierarchy </li> <li>Flexible working options</li> <li>Colleague recognition, reward and celebration events</li> <li>Global Employee Assistance Program</li> <li>ClassPass membership, giving you access to a variety of fitness and wellness experiences</li> <li>Ongoing learning and development opportunities, including LinkedIn Learning</li> <li>One paid ‘Giving Back Day' each year, so you can volunteer for a charity or community activity of your choice</li> <li>Subscription to the Calm app for you plus five friends/family members, giving you access to guided meditation, sleep stories, music, masterclasses, and much more</li> </ul><p></p><p></p><p></p><p><em>Equal Opportunity Employer Statement: Cognigy does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.</em><a rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p>"
  },
  {
    "id": "20716e",
    "title": "Domain Expert Voice",
    "department": "Engineering",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/519971C8F0",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "207171",
    "title": "Engineering Manager",
    "department": "Engineering",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/CDF73539FA",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "207174",
    "title": "Sr. Product Owner",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/4F398611A0",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees<br></p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $59M.</p><p><strong>Product Owner</strong><br></p><p><strong>Job location: on-site in Düsseldorf or remote in Germany  </strong></p><p><strong><strong>Your mission</strong></strong></p><ul>  <li>Collect and use data to analyze where and how we can      improve the usability and functionality of our products <br>      (Product, market and competition      analysis for product enhancements and new product development)</li> </ul><ul>  <li>Be in touch with our customers      to collect feedback and capture, analyze and document their requirements</li>  <li>Own the backlog and requirements management in accordance to      the release planning process</li> </ul><ul>  <li>Write detailed user stories for our development team      based on functional and non-functional requirements</li>  <li>Creation of mock-ups for new products before the      refinement process</li>  <li>Align with the development      teams regarding implementation of backlog items</li>  <li>Work closely with the Product      Owner as well as the development teams and support the agile development      processes</li>  <li>Evolve,      develop, and challenge yourself in an evolving company</li> </ul><p><br></p>",
    "requirements": "<p><strong>Requirements </strong></p><ul>  <li>You have experience in working successfully with      software development teams</li>  <li>You enjoy analyzing data and      searching for the best ways to visualize information, to enable effective      data-driven decision making</li>  <li>You have      experience in requirements engineering, business analysis and/ or system      analysis</li>  <li>You have a highly analytical      and curious intellect, as well as the ability to quickly familiarize      yourself with complex problems</li>  <li>You are a highly motivated team      player with a hands-on and “nothing-is-impossible\" mindset and      develop solutions proactively and independently</li> </ul><ul>  <li>You have the ability to build      excellent working relationships internally and externally with excellent      communication skills in English</li> </ul><p><strong>Desirable skills and experiences</strong></p><ul> <li>Out-of-the-box thinking and initiative.</li> <li>You own your area of responsibility</li> <li>Composure: Ability to meet deadlines even under time pressure, to improvise when roadblocks are reached</li> </ul><ul><li>You understand the market you operate in and are able to spot opportunities based on industry trends </li></ul>",
    "benefits": "<p><strong>What we offer</strong></p><ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home/ remote in Germany</li> </ul>"
  },
  {
    "id": "207175",
    "title": "QA Engineer",
    "department": "Engineering",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/26DC7D09C4",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "207178",
    "title": "Security and Data Privacy Architect",
    "department": "Engineering",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/D32E662C3E",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "207179",
    "title": "Technical Writer",
    "department": "Engineering",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/60197AAE67",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "20717b",
    "title": "Working Student",
    "department": "Engineering",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/CBF88B519B",
    "positionType": "Part-time",
    "workplaceType": "on_site",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "20717d",
    "title": "Tech Product Support",
    "department": "Engineering",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/489D4B0004",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "207181",
    "title": "Customer Success Manager",
    "department": "Sales",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/A0280A63EC",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "207192",
    "title": "Business Development Representative - UAE",
    "department": "Sales",
    "locations": [
      "Berlin, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/0DB620B2B6",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Location:  </strong><strong>Berlin/Düsseldorf, remote</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.</p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our team.</p><p>Team</p><p>The BDR team belongs to the Revenue team, which includes Marketing, Sales and Customer Success, is a high energy group that loves evangelizing and delivering industry-leading business solutions to both new and existing customers. The primary objectives of the global BDR team is to generate a pipeline for new, quality sales opportunities, land new customers and expand business within our existing customers.</p><p>You get the opportunity to experience a steep learning curve, because we coach and support you in matters of enterprise software sales.</p><p><strong>Your tasks</strong></p><ul> <li>As a BDR you will work closely with our sales manager / sales team and support the strategic development of a portfolio with target customers</li> <li>Outbound prospecting via phone, email and social as well as qualifying inbound &amp; outbound leads</li> <li>You maintain data in our CRM (Hubspot) so that we have conclusive data from our prospects</li> <li>You conduct initial discussions and give product demos to potential customers</li> <li>You represent Cognigy at trade fairs and conferences</li> </ul>",
    "requirements": "<ul> <li>Initial work experience with prospecting and sales</li> <li>Hands-on experience with multiple sales techniques (including cold calls)</li> <li>Ideally experience with CRM software (e.g. Hubspot)</li> <li>Motivated to work in Software Sales</li> <li>Excellent communication and negotiation skills</li> <li>Ability to deliver engaging presentations</li> <li>Fluency in English </li> <li>Fluent Arabic knowledge</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from the office in Düsseldorf or remote in the UK or Germany</li> </ul>"
  },
  {
    "id": "207196",
    "title": "BDR Manager",
    "department": "Sales",
    "locations": [
      "Berlin, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/678A69E809",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.</p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our team.</p><p><strong>BDR/SDR Manager - Global (m/f/d) </strong></p><p><strong>remote or on-site in Germany/UK</strong></p><p>The BDR Manager is responsible for leading Cognigy’s team of Business/Sales Development Representatives (outbound &amp; inbound) to provide qualified leads to the sales team.</p><p>The BDR Manager will oversee the global BDR team (US, EMEA, Australia) remotely, be very organized, accountable for the team’s success, take responsibility for continuous coaching, training of the team, and achieving goals/quotas. The Team Lead will align BDR goals and activities with our Go To Market strategy/plans to ensure the company achieves growth and expansion targets. This role works closely with the marketing and sales teams to maximize pipeline creation and reports to the VP Revenue Operations.</p><p>The ideal candidate is an ambitious, energetic, self-motivated player/coach with high social intelligence and a natural inclination to win. They are very driven and can show evidence that they thrive in a competitive, merit-based environment.</p><p><strong><strong>Team</strong></strong></p><p>The BDR team belongs to the Revenue team, which includes Marketing, Sales and Customer Success, is a high energy group that loves evangelizing and delivering industry-leading business solutions to both new and existing customers. The primary objectives of the Revenue team are to generate a pipeline for new, quality sales opportunities, land new customers, expand business within our existing customers, and retain 100% of our customers.</p><p>Still interested? Great!</p><p>Let’s have a look at the more detailed requirements, before we continue with what we can offer you in return.</p><p><strong>Your Responsibilities</strong></p><ul> <li>Lead, motivate, and direct the activities of assigned team members in order to achieve objectives, project schedules, and team goals in order to complete assignments within established time frames and specifications</li> <li>Preparing reports and analyzing data to improve processes, ensure resources are properly allocated, and maximize efficiency and client satisfaction. Additionally, possess the ability to present ideas and to communicate in writing, via emails and reports, or orally, explanations and data to support actions taken</li> <li>Addressing BDR questions and concerns, troubleshooting challenging calls or issues, diffusing &amp; handling client escalations</li> <li>Leading weekly meetings and consulting with team members to better understand call results, developing and maintaining processes, practices, and expectations</li> <li>Assisting other management team members in identifying trends and establishing goals</li> <li>Ensuring staff members are achieving desired service levels and taking corrective action, as needed.</li> <li>Taking on additional tasks or projects in the support of employees, fellow managers, and outbound operations.</li> </ul>",
    "requirements": "<ul> <li>High School Diploma or equivalent, University degree preferred.</li> <li>Ability to multitask and remain calm under pressure especially during intense situations.</li> <li>2-5 years of management experience, preferably in an outbound environment</li> <li>Experience using Hubspot or another CRM and able to use Excel</li> <li>Exceptional interpersonal, client service, problem-solving, verbal &amp; written communication, and conflict resolution skills.</li> <li>Knowledge of management principles and familiarity with company products, services, and policies.</li> <li>Strong coaching and leadership skills, ability to motivate employees.</li> <li>Decisiveness and attention to detail.</li> <li>Proficiency with necessary technology, including computers, software applications, phone systems, etc.</li> <li>Polite, professional phone/meeting presentation</li> <li>The ability to handle confidential information with the utmost discretion.</li> <li>Fluent in English.</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that all employees should benefit from the company’s success and therefore offer a virtual stock options plan</li> <li>We also offer you an attractive salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home/ remote in Germany or the UK</li> </ul><p><br></p><p>#LI-Remote </p>"
  },
  {
    "id": "2071d6",
    "title": "Technical Alliance Director",
    "department": "Sales",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/E5B5650A34",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong> </p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our sales team.</p><p><strong>The Team</strong></p><p>The <strong>Technical Alliance Director </strong>serves as a trusted technology advisor to the Cognigy Technology Alliances team, Business Development, Product Management, Engineering, and Sales– providing support and guidance that enables strategic partnership development, sales, and customer success. <br></p><p>You will be responsible for developing and managing strategic technology alliances with priority software vendors as required.  You will go deep in understanding the technology strategy, direction, and product capabilities of assigned partners, help Cognigy define and implement the best technological path to maximizing the value of the Cognigy.AI platform for customers of the partner’s platform, to support Cognigy GTM strategy development and execution and actively evangelize Cognigy in the market.</p><p><strong>Your responsibilities</strong></p><ul> <li>Develop and grow an ecosystem of complementary technical partnerships and alliances</li> <li>You have a high affinity for technology and can assess and articulate the effects and value of technical features</li> <li>You work closely with our Consulting, Sales, Partner and Presales teams, and you are not afraid to discuss technical issues</li> <li>Be the technology thought leader for assigned partnerships</li> <li>Maintain a deep understanding of the partner’s business and technology vision and strategies</li> <li>Initiate, develop, and maintain long-term relationships with technical and business focused contacts at partner organizations, in support of Cognigy’s business goals with partners</li> <li>Support the development and execution of technical partnership strategies and initiatives—including business plan creation and tracking, performing discovery, needs gathering, and requirements analysis/definition through prospects, partners, and customers</li> <li>Develop rich understanding of, and ability to, articulate key competitive value propositions for Cognigy over primary competitors</li> <li>Lead the internal/external execution of technically focused initiatives such as new solution development and certifications</li> <li>Act as the technical SME for partnership GTMs, and proactively evangelize partnerships</li> <li>Work across the Cognigy business to garner the appropriate resources: people; collateral; positioning; use cases; best practices; etc. to ensure alliance technical objectives are being met</li> <li>Showcase Cognigy technology through events and social media such as speaking at conferences, through webinars, recorded videos</li> </ul>",
    "requirements": "<ul> <li>5+ years of experience in a similar partner role</li> <li>Demonstrable track record of hitting revenue and growth targets</li> <li>Strong knowledge of enterprise technologies</li> <li>Comfortable presenting to and influencing CxO level audiences</li> <li>Strong business acumen combined with a deep understanding of complex and highly scalable technical architectures of enterprise applications and a broad understanding of SaaS / communication/automation technologies, and solutions</li> <li>First-hand experience in cross-group collaboration and leadership</li> <li>Ability to support sales in the field</li> <li>Must be a self-starter with excellent ability to work independently</li> <li>Ready to travel, included but not limited to partner meetings, conferences, on-site enablement activities</li> <li>Fluent in English</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from the office in Düsseldorf or remote in the UK or Germany</li> </ul>"
  },
  {
    "id": "2071d9",
    "title": "OEM Alliances Director",
    "department": "Sales",
    "locations": [
      "Boston, United States"
    ],
    "shortlink": "https://apply.workable.com/j/A1B5DDEF84",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>About Cognigy</strong></p><p>Cognigy, a market leader in Conversational AI, powers up enterprise contact centers to exceed customer expectations, improve agent satisfaction and rapidly respond to market changes. The Cognigy.AI platform enables next-generation customer service, with a suite of solutions including Conversational IVR, Smart Self-Service, and Agent + Assist. Cognigy.AI gives the enterprise what it needs to deliver always-on, personalized service experiences at scale, on both voice and chat.</p><p>Our skilled #CognigyCrew are the people behind our cutting-edge technology and we are now looking for more talented people to join our global team.</p><p><strong>Why you’ll love working at Cognigy: our promise to you</strong></p><p>We empower our people to be successful as part of a diverse, passionate and respectful team who are proud to be enabling customer and employee service that is loved by everyone.</p><p>We do this by challenging each other to succeed and being enabled to do our best work. Encouraging and supporting growth is at the heart of our success, founded on a culture of mutual respect and trust – always! It’s no wonder that the values that inspire and drive our #CognigyCrew are our 4Ts: <strong>Team</strong>, <strong>Trust</strong>, <strong>Transparency</strong>, <strong>Technology</strong>.</p><p><strong>The Team:</strong></p><p>You will be part of the Global Partner Organisation with your team members all over the globe. In this role you will be our first OEM Partner Director fostering partnerships with our current OEMs while also developing new business.</p>  <p>You will have a strong interest in Enterprise Software, creating better customer experience and ideally have previous experience and/or knowledge of Conversational AI and the contact centre space. </p><p><strong>Responsibilities</strong></p><ul>  <li>Manage and foster relationships with current OEMs and identify prospective OEM partners to build out new partnerships</li>  <li>Designing and delivering on joint value      partnership campaigns</li>  <li>Spearheading      demand generation and awareness marketing for, and with your partners to      reach your goals</li> <li>Develop strong expertise in the partner's business to find combined areas for expansion</li> <li>Strong focus in this role will be on generating new license ACV and transforming the OEMs business, while generating new revenue streams for them</li> </ul>",
    "requirements": "<ul> <li>5+ years experience dealing with partners, OEMs, ISVs &amp; resellers in the Enterprise Software Space</li> <li>Strong previous success with overachieving on      quota and revenue goals</li>  <li>Familiarity with AI and ML technology and the contact center</li> <li>Contact center experience, specifically experience with contact center providers, vendors, BPOs and system integrators</li> <li>Strong critical thinking and problem solving      skills</li>  <li>Comfortable with change and navigating ambiguity</li>  <li>Good experience presenting technical and business value to C-level      executives</li>  <li>Proven consultative sales solution skills</li>  <li>Willingness      to travel</li> </ul>",
    "benefits": "<p><strong>Life at Cognigy: what we offer you</strong></p>  <p>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome. Our excellent benefits make us a fantastic place to work - these include:</p>  <ul> <li>Attractive and performance-oriented salary</li> <li>Company pension plan</li> <li>Discretionary virtual stock options plan, so you can benefit from the company’s success</li> <li>Unique opportunity to help build and shape the company, with little hierarchy </li> <li>Flexible and remote working options</li> <li>Colleague recognition, reward and celebration events</li> <li>Global Employee Assistance Program</li> <li>ClassPass membership, giving you access to a variety of fitness and wellness experiences</li> <li>Ongoing learning and development opportunities, including LinkedIn Learning</li> </ul>"
  },
  {
    "id": "2071e4",
    "title": "Sr. Account Executive - UAE",
    "department": "Sales",
    "locations": [
      "Dubai, United Arab Emirates"
    ],
    "shortlink": "https://apply.workable.com/j/B4055AFDE8",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "<p><strong>Cognigy</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $59M.</p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our sales team in Dubai!</p><p><br><strong>Your job:</strong><br></p><p>To reinvent an industry, we are building out the best team. That’s why we are looking for you as our first Sr. Entreprise Account Executive at Cognigy in Dubai. As a Sr. Account Executive you will work closely with our prospective customers to understand their challenges and goals and identify how Cognigy can help them.<br></p><p><strong>Responsibilities:</strong><br></p><ul> <li>You are responsible for acquiring new entreprise companies from all industries in the MEA region and you position our leading Conversational.AI platform (SaaS + On-Premise).</li> <li>You are responsible for the full sales cycle, the processing of tendering processes and you take on the overall responsibility for complex contract negotiations with the decision-makers at management level (C-Level)</li> <li>You are responsible for the implementation of web demos and customer meetings on site as well as the independent and professional preparation of discussions with customer-specific product presentations</li> <li>You will be working closely with your Presales Consultants and your Business Development Representative</li> <li>You act as a Trusted Advisor to your prospective customers at any time during the sales cycle</li> <li>You represent Cognigy at trade fairs or events that are customary in the industry</li> <li>The continuous optimization of the cooperation with customers through up- and cross-selling is your responsibility</li> <li>You will help shape our product roadmap and the permanent refreshment of product knowledge</li> </ul>",
    "requirements": "<ul> <li>You have at least 3-5 years of enterprise sales experience, preferably in the areas of SaaS</li> <li>You can present yourself confidently and empathetically at all management levels (including C-Level)</li> <li>You have strong entrepreneurial skills and have a high affinity for customer acquisition</li> <li>In addition to direct sales, you are also used to acquire new customers together with our partners and supporting them in the sales process.</li> <li>You shine through your professional communication and negotiation skills as well as your customer-oriented and personable demeanor</li> <li>You work in a very structured, organized manner and you know how to prioritize</li> <li>Fluent English skills - Fluency in Arabic a strong benefit</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home/ remote in Dubai</li> </ul>"
  },
  {
    "id": "2071e8",
    "title": "Partner Manager - UAE",
    "department": "Sales",
    "locations": [
      "Dubai, United Arab Emirates"
    ],
    "shortlink": "https://apply.workable.com/j/1C71AECFD4",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "2071eb",
    "title": "Partner Operations Manager",
    "department": "Sales",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/2F02D900D6",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees </p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M. </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our team. </p><p><strong>Partner Operations Manager (m/f/d)</strong> </p><p><strong>remote or on-site in Europe (Germany preferred)</strong> </p><p>We are looking for a curious and hands-on Partner Operations Manager who wants to build with us the world’s most effective partner and sales organization. You will build processes that are best-in-class to help increase the effectiveness and speed of all customer facing teams. To ensure we are on the right track, you will set and monitor KPIs together with our commercial leadership (e.g. tracking business results, performing cost-benefit analyses and monitoring production KPIs). To be successful in this role, you should have experience in a similar role, have a curious mindset and be able to manage projects across different business areas You should also demonstrate great execution skills and be able to communicate the vision of the company across all levels.  </p><p>This role can be performed remotely from your home office anywhere in Germany or at our locations such as Berlin and Düsseldorf. </p>",
    "requirements": "<p><strong>Requirements</strong> </p><ul> <li>3+ years of sales operations experience or experience in a similar role </li> <li>The ability to understand the needs and expectations of our customers and employees, develop ideas and strategies to create the perfect customer experience using tools and methodologies that also drive strong sales teams forward.</li> <li>A good grasp and enjoyment of data-driven tasks in collaboration with our senior management team, experience with databases is a plus.</li> </ul><ul> <li>Experience with forecasting models and commercial target setting is a big plus </li> <li>Good knowledge of different sales processes and tools, experience in using Microsoft Office or Google Suite (especially Excel/Google Sheets or Slides/PowerPoint), as well as experience in using HubSpot or Salesforce as a CRM are required. </li> <li>Fluency in English is required. <br> </li> </ul><p><strong>Responsibilities </strong><br></p><ul> <li>Implement best practices in sales operations and sales enablement at Cognigy and help our international sales and partner teams to apply them in their day-to-day operations.</li> <li>Identify optimization potential in sales development, sales and partner management and initiate appropriate measures to improve key performance indicators and further develop our customer approaches</li> <li>Develop ideas to grow our customer base and improve sales processes through data and shadowing of sales people and establish appropriate training across our product groups.</li> <li>Create forecasts on sales and customer development and develop the results and optimisation potential with senior management.</li> <li>Monitor financial data and recommend solutions that will improve profitability</li> </ul><ul><li>Take into account the needs of external and internal stakeholders and incorporate them into new strategic plans</li></ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome </li> <li>We believe that all employees should benefit from the company’s success and therefore offer a virtual stock options plan </li> <li>We also offer you an attractive salary </li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization </li> </ul><ul><li>Flexible working hours and ability to work from home/ remote in Germany or the UK </li></ul>"
  },
  {
    "id": "2071f0",
    "title": "Revenue Operations Manager",
    "department": "Sales",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/1D05DF0BCE",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Our Vision: Customer &amp; Employee Service that is Loved by Everyone! <br></strong> <br>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centered around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees. </p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA, and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $59M. </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our team. </p><p><br></p><p><strong>Revenue Operations Manager (m/f/d)<br></strong></p><p><strong>Remote or on-site in Europe (Germany preferred) </strong></p><p>As our Revenue Operations Manager, you will help us to build the world’s most effective revenue organization, by defining and executing best practices via systems architecture, data analysis, reporting, and process improvements. </p><p>You will build processes that are best-in-class to help increase the effectiveness and speed of global marketing, business development, sales, customer success and partner teams.  </p><p>To ensure we are on the right track, you will set and monitor KPIs together with our commercial leadership (e.g. tracking business results, and monitoring production KPIs).  </p><p>To be successful, you should have experience in a similar role, have a curious mindset and be able to manage projects across different business areas. You should also demonstrate great execution skills and be able to communicate the vision of the company across all levels.  </p><p>Knowledge of tools, processes, and key metrics along the modern Saas revenue funnel will help you to define where your work can be most effective. </p><p>This role can be performed remotely from your home office anywhere in Germany or the United Kingdom, or at our head office in Düsseldorf. </p><p><br></p><p><strong>Responsibilities</strong> </p><ul> <li>Implement best practices in processes and tools to improve conversion rate and speed at all levels along the revenue funnel and help our international marketing, sales, customer success and partner teams to apply them in their day-to-day operations. </li> <li>Deliver business reporting and forecasts, </li> <li>Identify optimization potential along the revenue funnel and initiate appropriate measures to improve key performance indicators and further develop our go-to-market approach. </li> <li>Develop ideas to grow our customer base and improve sales processes through data and shadowing of customer facing teams and establish appropriate training across our product groups. </li> <li>Consider the needs of external and internal stakeholders and incorporate them into new strategic plans </li> </ul>",
    "requirements": "<ul> <li>Revenue operations experience in a SaaS (Software as a Service) organization, having worked in a high-growth environment is a plus </li> <li>Strong understanding of SaaS metrics, customer lifecycle, and a customer-centric mentality – experience with databases is a plus</li> </ul><ul> <li>The ability to understand the needs and expectations of our customers and employees, develop ideas and strategies to create the perfect customer experience using tools and methodologies that also drive strong revenue teams forward. </li> <li>Experience with forecasting models and commercial target setting </li> <li>Strong analytical and problem-solving skills </li> <li>Good knowledge of processes and tools along the revenue funnel</li> <li>Experience in using Microsoft Office or Google Suite (especially Excel / Google Sheets or Slides / PowerPoint), as well as experience using HubSpot or Salesforce as a CRM are required</li> </ul><ul><li>Fluency in English is required</li></ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome </li> <li>We believe that all employees should benefit from the company’s success and therefore offer a virtual stock options plan</li> <li>We also offer you an attractive salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home/ remote in Germany or the United Kingdom </li> </ul><h3>  </h3>"
  },
  {
    "id": "207219",
    "title": "Partner Director - APAC",
    "department": "Sales",
    "locations": [
      "Australia"
    ],
    "shortlink": "https://apply.workable.com/j/F7F7FDC47E",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy </strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p><p><strong>The Team:</strong></p><p>We are growing in the APAC market and are looking to expand our alliances network. Focus is on the Big 4, leading global consultancies and strong regional players. Our alliance network is fundamental for our success. You will lead the alliances business and will design and shape our future alliance strategy in APAC.  </p><p><strong>What You'll Be Doing</strong> <br></p><ul> <li>You will develop and implement the alliance strategy for APAC to support the regional revenue target through sourcing and influencing deals with SI (Deloitte, Accenture, KPMG, etc.) and VAR partners </li> <li>You will manage our key partnerships by building a strong personal network on all levels. </li> <li>You will define joint Go-to-Market strategies and business plans with key partners </li> <li>You will support the enablement and development of partner awareness, onboarding, and adoption programs to accelerate partner contribution. </li> </ul><ul> <li>You will work closely with the APAC Sales Team and collaborate effectively with the wider Global Strategic Alliances team to ensure programs and activities are coordinated and best practices are shared </li> <li>You will have quota responsibility for the APAC overlay revenue across defined partner channels; manage programs to maximize pipeline development, sales revenue and influence revenue from across all channel partners. </li> </ul>",
    "requirements": "<ul> <li>You have 5+ years partner management experience ideally at a global SI or a Software Vendor</li> <li>You’ll have strong networking skills and a personal network at global SI’s like Deloitte, Accenture, Capgemini, KPMG </li> <li>You have a strong entrepreneurial thinking and the mindset and motivation to build the next unicorn </li> <li>You are a team player with experience working with a direct sales team in a collaborative, co-sell environment. Can-do attitude towards supporting teammates, colleagues and partners to solve problems </li> <li>You are quota driven with experience generating partner sourced pipeline and also experience working with partners to co-sell and influence revenue </li> </ul>",
    "benefits": "<ul><li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome </li></ul><ul> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers </li> <li>We also offer you an attractive and performance-oriented salary </li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization </li> <li>Flexible working hours and ability to work from the office or remotely in Australia. </li> </ul><p><br></p><p>#LI-Remote </p>"
  },
  {
    "id": "2072d0",
    "title": "Sales Recruiter",
    "department": "Finance",
    "locations": [
      "London, United Kingdom"
    ],
    "shortlink": "https://apply.workable.com/j/7E097795DB",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees </p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.   </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our recruitment team with a: </p><p><strong>Recruiter</strong> </p><p>Job location: UK, Germany </p><p>As a Recruiter, you will join us as the third dedicated inhouse recruitment resource for Cognigy. You will take full ownership for your roles, additionally to being focused on sourcing for high priority roles in collaboration with your recruitment colleagues. We recruit our talent across the globe, from working students to Executives.  </p><p> <br>To be successful in this role you will have a passion for recruiting excellence, have strong experience with outbound sourcing &amp; 360 degrees recruitment.</p><p><strong>Responsibilities</strong><br></p><ul> <li>Recruiting exceptional talent </li> <li>Identify and source new candidates with a focus on sales roles </li> <li>Managing relationships with hiring managers </li> <li>Manage the full life cycle recruiting process for your own set off roles </li> <li>Complete candidate ownership from the moment they apply until they get onboard </li> </ul><ul> <li>Manage tracking and reporting </li> <li>Identify new hiring opportunities &amp; events </li> <li>Help improve our hiring practices </li> </ul>",
    "requirements": "<ul> <li>Experience as a recruiter or sourcing specialist for sales &amp; professional service roles, ideally in the Tech world </li> <li>Knowledge of US &amp; German recruitment market </li> <li>You have a structured &amp; creative mindset to continuously improve our recruiting process </li> </ul><ul> <li>Proven track record sourcing, interviewing, and attracting passive candidates </li> <li>Ability to excite candidates for the opportunity and journey that Cognigy is on </li> <li>Skilled in building relationships </li> <li>Experience with Applicant Tracking Systems, ideally Workable </li> <li>Fluent in English &amp; ideally in German.  </li> </ul>",
    "benefits": "<ul><li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome  </li></ul><ul> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers </li> <li>We also offer you an attractive and performance-oriented salary </li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization  </li> <li>Flexible working hours and ability to work from home / remote in Germany, Spain or the UK. Alternatively, you can work from our Düsseldorf HQ </li> <li>A great culture built on our core values of Team, Trust, Technology and Transparency</li> </ul>"
  },
  {
    "id": "20be71",
    "title": "Sr. Enterprise Account Executive - BNL",
    "department": "Sales",
    "locations": [
      "Netherlands"
    ],
    "shortlink": "https://apply.workable.com/j/F60127D1E1",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.</p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our team.</p><p><strong>Job location:</strong><br><em>The role can be based out of the Netherlands, but you will be contracted to our German Entity, Cognigy GmbH.</em></p><p><strong>Your job: </strong></p><p>To reinvent an industry, we are building out the best team. <strong>That’s why we are looking for you</strong> as a <strong>Sr. Entreprise Account Executive </strong>at Cognigy. As an Account Executive you will work closely with our prospective customers to understand their challenges and goals and identify how Cognigy can help them.<br></p><p><br></p><p><strong>Responsibilities:  </strong></p><ul> <li>You are our first Account Executive in the region and responsible for acquiring new entreprise companies from all industries in the Benelux and you position our leading Conversational.AI platform (SaaS + On-Premise).</li> <li>You are responsible for the full sales cycle, the processing of tendering processes and you take on the overall responsibility for complex contract negotiations with the decision-makers at management level (C-Level)</li> <li>You are responsible for the implementation of web demos and customer meetings on site as well as the independent and professional preparation of discussions with customer-specific product presentations</li> <li>You will be working closely with your Presales Consultants and your Business Development Representative</li> <li>You act as a Trusted Advisor to your prospective customers at any time during the sales cycle</li> <li>You represent Cognigy at trade fairs or events that are customary in the industry</li> <li>The continuous optimization of the cooperation with customers through up- and cross-selling is your responsibility</li> <li>You will help shape our product roadmap and the permanent refreshment of product knowledge</li> </ul>",
    "requirements": "<ul> <li>You have at least 3-5 years of enterprise sales experience, preferably in the areas of software solutions, online marketing solutions or web content management</li> <li>You can present yourself confidently and empathetically at all management levels (including C-Level)</li> <li>You have strong entrepreneurial skills and have a high affinity for customer acquisition</li> <li>In addition to direct sales, you are also used to acquire new customers together with our partners and supporting them in the sales process. </li> <li>You shine through your professional communication and negotiation skills as well as your customer-oriented and personable demeanor</li> <li>You work in a very structured, organized manner and you know how to prioritize</li> <li>Fluent Dutch and very good English skills complete your profile. German language skills are beneficial.</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization </li> <li>Flexible working hours and ability to work from home/ remote in Germany</li> </ul><p><br></p><p>#LI-Remote </p>"
  },
  {
    "id": "20be76",
    "title": "Sr. Frontend (React.js) Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/E588EE7142",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our engineering team.</p><p><strong>The Team</strong><br></p><p>You will be welcomed into our engineering department by our talented and passionate team of over 35 people and growing fast!<br></p><p>Our engineering department is divided into cross-functional, verticalized development teams, who are focused on delivering continuous improvements, features and developing new products. To support the delivery process and stability of our products, we can also count on our Product Support team, QA team, and SRE team who, alongside our Product and People team, Director/Architect and VP Engineering, are constantly looking to overcome new challenges, to innovate, and to guarantee the success of our products and general satisfaction of our customers.</p><p><strong>Your challenge:<br></strong></p><ul> <li>Producing clean, readable and well-tested frontend code</li> <li>You have an eye on the look and feel of our user interface and will participating in planning meetings with our UX engineers to design the future of our product</li> <li>Helping us to build-up automated cross-browser testing procedures</li> <li>Implementing and improving our frontend development pipeline to increase the productivity and automating time-consuming build-jobs</li> <li>Providing guidance to other frontend developers and act as a mentor</li> </ul>",
    "requirements": "<ul> <li>Several years of experience with React.JS in conjunction with Typescript</li> <li>Several years of experience with bundlers like Webpack and Rollup – you can not only use these tools, but you also love to tweak their configuration files</li> <li>You have “a feeling for good design” – padding and margin are not just CSS properties for you, you love to create pixcel-perfect user interfaces</li> <li>Experience with Realtime communication protocols such as WebSocket or WebRTC</li> <li>Experience with testing frameworks and libraries such as Mocha, Chai and Cypress</li> <li>Experience in debugging client-side browser applications</li> <li>Good communication skills and the ability to present new concepts in front of our management</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home/ remote in Germany</li> </ul>"
  },
  {
    "id": "20be89",
    "title": "Business Development Representative - Benelux",
    "department": "Sales",
    "locations": [
      "Berlin, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/4DB53F7AC6",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "<p><strong>Location</strong>: Berlin or Düsseldorf, Germany<br></p><p><strong>Cognigy</strong> </p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our team.</p><p><strong>Team</strong></p><p>The BDR team belongs to the Revenue team, which includes Marketing, Sales and Customer Success. This team is a high energy group that loves evangelizing and delivering industry-leading business solutions to both new and existing customers. The primary objectives of the global BDR team is to generate a pipeline for new, quality sales opportunities, land new customers and expand business within our existing customers.</p><p>You get the opportunity to experience a steep learning curve, because we coach and support you in matters of enterprise software sales.</p><p><strong>Your tasks</strong></p><ul> <li>As a BDR you will work closely with our sales manager / sales team and support the strategic development of a portfolio with target customers</li> <li>Outbound prospecting via phone, email and social as well as qualifying inbound &amp; outbound leads</li> <li>You maintain data in our CRM (Hubspot) so that we have conclusive data from our prospects</li> <li>You conduct initial discussions and give product demos to potential customers</li> <li>You represent Cognigy at trade fairs and conferences</li> </ul>",
    "requirements": "<ul> <li>Initial work experience as a Business Development Representative, Sales Development Representative or similar role</li> <li>Hands-on experience with multiple sales techniques (including cold calls)</li> <li>Ideally experience with CRM software (e.g. Hubspot)</li> <li>Motivated to work in Software Sales</li> <li>Excellent communication and negotiation skills</li> <li>Ability to deliver engaging presentations</li> <li>Fluency in English and <strong>Dutch</strong> </li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from the office in Düsseldorf or remote in the UK or Germany</li> </ul>"
  },
  {
    "id": "20cba4",
    "title": "Business Development Representative - Americas",
    "department": "Sales",
    "locations": [
      "Boston, United States"
    ],
    "shortlink": "https://apply.workable.com/j/101450938B",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>About Cognigy</strong></p><p>Cognigy, a market leader in Conversational AI, powers up enterprise contact centers to exceed customer expectations, improve agent satisfaction and rapidly respond to market changes. The Cognigy.AI platform enables next-generation customer service, with a suite of solutions including Conversational IVR, Smart Self-Service, and Agent + Assist. Cognigy.AI gives the enterprise what it needs to deliver always-on, personalized service experiences at scale, on both voice and chat.</p><p>Our skilled #CognigyCrew are the people behind our cutting-edge technology and we are now looking for more talented people to join our global team.</p><p><strong>Why you’ll love working at Cognigy: our promise to you</strong></p><p>We empower our people to be successful as part of a diverse, passionate and respectful team who are proud to be enabling customer and employee service that is loved by everyone.</p><p>We do this by challenging each other to succeed and being enabled to do our best work. Encouraging and supporting growth is at the heart of our success, founded on a culture of mutual respect and trust – always! It’s no wonder that the values that inspire and drive our #CognigyCrew are our 4Ts: <strong>Team</strong>, <strong>Trust</strong>, <strong>Transparency</strong>, <strong>Technology</strong>.<br><br></p><p><strong>About the role<br>Location: Based remotely in or around Boston, Massachusetts</strong></p><p>The BDR team belongs to the Revenue team, which includes Marketing, Sales and Customer Success. The team is a high energy group that loves evangelizing and delivering industry-leading business solutions to both new and existing customers. The primary objectives of the global BDR team is to generate a pipeline for new, quality sales opportunities, land new customers and expand business within our existing customers.</p><p>You get the opportunity to experience a steep learning curve, because we coach and support you in matters of enterprise software sales.<br><br></p><p><strong>Your tasks</strong></p><ul> <li>As a BDR you will work closely with our sales manager / sales team and support the strategic development of a portfolio with target customers</li> <li>Outbound prospecting via phone, email and social media, as well as qualifying inbound &amp; outbound leads</li> <li>You maintain data in our CRM (Hubspot) so that we have conclusive data from our prospects</li> <li>You conduct initial discussions and give product demos to potential customers</li> <li>You represent Cognigy at trade fairs and conferences</li> </ul>",
    "requirements": "<ul> <li>Work experience as a Business Development Representative, Sales Development Representative, or similar role (i.e. lead generation, market development, etc.)</li> <li>Hands-on experience with multiple sales techniques (including cold calls)</li> <li>Ideally experience with CRM software (e.g. Hubspot)</li> <li>Motivated to work in Software Sales</li> <li>Excellent communication and negotiation skills</li> <li>Ability to deliver engaging presentations</li> <li>Fluent in English</li> </ul>",
    "benefits": "<p><strong>Life at Cognigy: what we offer you</strong></p>  <p>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome. Our excellent benefits make us a fantastic place to work - these include:</p>  <ul> <li>Attractive and performance-oriented salary</li> <li>Company pension plan</li> <li>Discretionary virtual stock options plan, so you can benefit from the company’s success</li> <li>Unique opportunity to help build and shape the company, with little hierarchy </li> <li>Flexible and remote working options</li> <li>Colleague recognition, reward and celebration events</li> <li>Global Employee Assistance Program</li> <li>ClassPass membership, giving you access to a variety of fitness and wellness experiences</li> <li>Ongoing learning and development opportunities, including LinkedIn Learning</li> </ul>"
  },
  {
    "id": "2132ae",
    "title": "Enterprise Account Executive - DACH",
    "department": "Sales",
    "locations": [
      "Berlin, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/FFB29EA064",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate <strong>AI-powered virtual agents</strong> to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.</p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our sales team.</p><p><br></p><p><strong>Your job: </strong></p><p>To reinvent an industry, we are building out the best team. <strong>That’s why we are looking for you</strong> as an <strong>Entreprise Account Executive </strong>at Cognigy. As an Account Executive you will work closely with our prospective customers to understand their challenges and goals and identify how Cognigy can help them.<br></p><p><br></p><p><strong>Responsibilities:  </strong></p><ul> <li>You are responsible for acquiring new enterprise companies from all industries in the DACH region and you position our leading Conversational.AI platform (SaaS + On-Premise).</li> <li>You are responsible for the full sales cycle, the processing of tendering processes and you take on the overall responsibility for complex contract negotiations with the decision-makers at management level (C-Level)</li> <li>You are responsible for the implementation of web demos and customer meetings on site as well as the independent and professional preparation of discussions with customer-specific product presentations</li> <li>You will be working closely with your Presales Consultants and your Business Development Representative</li> <li>You act as a Trusted Advisor to your prospective customers at any time during the sales cycle</li> <li>You represent Cognigy at trade fairs or events that are customary in the industry</li> <li>The continuous optimization of the cooperation with customers through up- and cross-selling is your responsibility</li> <li>You will help shape our product roadmap and the permanent refreshment of product knowledge</li> </ul>",
    "requirements": "<ul> <li>You have at least 1-3 years of full cycle sales experience, in the areas of software solutions, online marketing solutions or web content management</li> <li>You can present yourself confidently and empathetically at all levels</li> <li>You have strong entrepreneurial skills and have a high affinity for customer acquisition</li> <li>In addition to direct sales, you are also used to acquire new customers together with our partners and supporting them in the sales process. </li> <li>You shine through your professional communication and negotiation skills as well as your customer-oriented and personable demeanor</li> <li>You work in a very structured, organized manner and you know how to prioritize</li> <li>Fluent German and very good English skills complete your profile</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization </li> <li>Flexible working hours and ability to work from home/ remote in Germany or in our Düsseldorf HQ</li> </ul><p><br></p><p><br></p>"
  },
  {
    "id": "213f50",
    "title": "Business Development Representative - DACH",
    "department": "Sales",
    "locations": [
      "Berlin, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/07E8F517A5",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong><br></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees.</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $59M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our team.</p><p><br></p><p><strong>Business Development Representative - DACH</strong></p><p>Location: Based remotely in or around Berlin or Dusseldorf, Germany</p><p>The BDR team belongs to the Revenue team, which includes Marketing, Sales and Customer Success. The team is a high energy group that loves evangelizing and delivering industry-leading business solutions to both new and existing customers. The primary objectives of the global BDR team is to generate a pipeline for new, quality sales opportunities, land new customers and expand business within our existing customers.</p><p>You get the opportunity to experience a steep learning curve, because we coach and support you in matters of enterprise software sales.</p><p><br></p><p><strong>Your tasks</strong></p><ul> <li>As a BDR you will work closely with our sales manager / sales team and support the strategic development of a portfolio with target customers</li> <li>Outbound prospecting via phone, email and social media, as well as qualifying inbound &amp; outbound leads</li> <li>You maintain data in our CRM (Hubspot) so that we have conclusive data from our prospects</li> <li>You conduct initial discussions and give product demos to potential customers</li> <li>You represent Cognigy at trade fairs and conferences</li> </ul>",
    "requirements": "<ul> <li>Initial work experience with prospecting and sales </li> <li>Hands-on experience with multiple sales techniques (including cold calls)</li> <li>Ideally experience with CRM software (e.g. Hubspot)</li> <li>Motivated to work in Software Sales</li> <li>Excellent communication and negotiation skills</li> <li>Ability to deliver engaging presentations</li> <li>Fluency in <strong>English and German</strong> </li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from the office in Düsseldorf or remote in Germany</li> </ul>"
  },
  {
    "id": "213f53",
    "title": "Solution Architect - US",
    "department": "Sales",
    "locations": [
      "New York, United States"
    ],
    "shortlink": "https://apply.workable.com/j/F2FDBE54E2",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong> </p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $59M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our consulting team.</p><p><br></p><p><strong>The role:</strong></p><p>Looking for a new challenge on the cutting-edge of technology? Interested in chatbots, voice devices and automation? Come join us!</p><p>We are looking for a Solution Architect to join our Consulting team of product experts who work with our clients and partners to build innovative Conversational AI implementations.</p><p>You will be the <strong>go-to person for deep technical questions</strong> about our conversational AI platform and <strong>will be involved with the project from start to finish</strong>. This means that <strong>you are involved with the requirements gathering</strong> as well as <strong>actual development</strong> and y<strong>ou have a talent for translating customer demands to concrete technical solutions</strong>.</p><p>You will be working with Cognigy.AI integration partners like Deloitte, Accenture or Codecentric in larger implementation projects.<br><br>Ideally, you have had some years of <strong>experience in enterprise software with systems</strong> like SAP, Oracle, Salesforce and ServiceNow or contact center applications like Genesys, Avaya or NICE inContact.<br><br>Still interested? Great!</p>",
    "requirements": "<ul> <li>You have strong experience in Professional Services</li> <li>You are a team player and love to talk to customers and partners</li> <li>You are hands-on with technologies like Node.JS</li> <li>You are able to find solutions to the most complex technical requirements and love implementing them</li> <li>You are self-motivated, pro-active and capable of structuring your work in order to deliver</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome  </li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization </li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers </li> <li>We also offer you an attractive and performance-oriented salary </li> <li>Great benefits, including health/dental/vision and 401k </li> <li>Flexible working hours and ability to work from home in the US</li> </ul>"
  },
  {
    "id": "21406a",
    "title": "Product Marketing Manager",
    "department": "Marketing",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/551148D5F1",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy </strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our marketingteam with a:</p><p><strong>Product Marketing Manager </strong></p><p><strong>- on-site or remote in Germany</strong></p><p>To foster our ambitious growth strategy, we extend our Product Marketing team with an experienced, performance-oriented specialist with a passion for technology, marketing and B2B communication.  </p><p>As a member of Cognigy’s global marketing unit you support our communication strategies with a focus on our technology and its business value for our buyers. You own a broad range of projects and initiatives targeting at business managers as well as technical stakeholders. With your know-how and experience, Cognigy’s leading-edge AI technology is brought to market with a laser-sharp messaging, securing our leadership in Customer Service Automation and Conversational AI.<br><br></p><p><strong>Your Tasks</strong> </p><ul> <li>You develop deep expertise in Cognigy’s technology, products, markets, and stakeholders’ needs  </li> <li>As part of the Product Marketing team, you crystalize the benefits and points of differentiation into market-facing messaging and communicate clearly to prospects and stakeholders on all channels </li> <li>You tackle a broad variety of operational and strategic tasks, and plan and execute your projects independently </li> </ul><ul> <li>You drive asset creation (blogs, whitepapers, video scripts, presentations etc.) with technical understanding, writing talent, and storytelling skills </li> <li>You become part of our international team and you join a global, high-speed, result-focused workspace </li> </ul><p><br></p>",
    "requirements": "<ul><li>+3 years of experience e.g. as Product Marketing Manager, Product Manager, Evangelist or similar in software or IT industry, ideally B2B</li></ul><ul> <li>You have excellent skills in English language (ideally also German), both spoken and written</li> <li>You have a proven track record of Product Marketing asset creation</li> <li>You are enthusiastic about technology and familiar with current trends, and you also have hands-on experience with complex software. (You don’t need to be programmer, but you should not be scared when you see code.)</li> <li>You have a generalist mindset that allows you to cover a broad spectrum of tasks</li> <li>You’re open for innovation you love to tackle new challenges, every day</li> </ul><ul><li>PR experience is a plus </li></ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home/ remote in Germany</li> </ul><p><br></p><p>#LI-Remote </p>"
  },
  {
    "id": "214130",
    "title": "Sr. Frontend (React.js) Engineer",
    "department": "Engineering",
    "locations": [
      "Málaga, Spain"
    ],
    "shortlink": "https://apply.workable.com/j/305F430B59",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our engineering team.</p><p><strong>The Team</strong><br></p><p>You will be welcomed into our engineering department by our talented and passionate team of over 35 people and growing fast!<br></p><p>Our engineering department is divided into cross-functional, verticalized development teams, who are focused on delivering continuous improvements, features and developing new products. To support the delivery process and stability of our products, we can also count on our Product Support team, QA team, and SRE team who, alongside our Product and People team, Director/Architect and VP Engineering, are constantly looking to overcome new challenges, to innovate, and to guarantee the success of our products and general satisfaction of our customers.</p><p><strong>Your challenge:<br></strong></p><ul> <li>Producing clean, readable and well-tested frontend code</li> <li>You have an eye on the look and feel of our user interface and will participating in planning meetings with our UX engineers to design the future of our product</li> <li>Helping us to build-up automated cross-browser testing procedures</li> <li>Implementing and improving our frontend development pipeline to increase the productivity and automating time-consuming build-jobs</li> <li>Providing guidance to other frontend developers and act as a mentor</li> </ul>",
    "requirements": "<ul> <li>Several years of experience with React.JS in conjunction with Typescript</li> <li>Several years of experience with bundlers like Webpack and Rollup – you can not only use these tools, but you also love to tweak their configuration files</li> <li>You have “a feeling for good design” – padding and margin are not just CSS properties for you, you love to create pixcel-perfect user interfaces</li> <li>Experience with Realtime communication protocols such as WebSocket or WebRTC</li> <li>Experience with testing frameworks and libraries such as Mocha, Chai and Cypress</li> <li>Experience in debugging client-side browser applications</li> <li>Good communication skills and the ability to present new concepts in front of our management</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home</li> </ul>"
  },
  {
    "id": "214137",
    "title": "Sr. Backend (Node.js) Engineer - Spain",
    "department": "Engineering",
    "locations": [
      "Málaga, Spain"
    ],
    "shortlink": "https://apply.workable.com/j/FD08243222",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our engineering team.</p><p><strong>Your challenge:<br></strong></p><ul> <li>Producing a clean, readable and well-tested code</li> <li>Improvement and testing of already existing code and documentation</li> <li>Helping us to increase unit-testing coverage for existing code</li> <li>Profiling and benchmarking our existing codebase to identify bottlenecks</li> <li>Measuring the performance of database-queries and helping us to reduce network overhead in our microservices-based product-architecture</li> </ul>",
    "requirements": "<ul> <li>Several years of experience in backend development (ideally in Node.JS/ Typescript)</li> <li>Several years of experience with MongoDB or a similar NoSQL database including expertise in profiling database queries</li> <li>Experience with containers and debugging containerized applications</li> <li>Experience in building a large-scale software product</li> <li>Experience with writing well-tested and high-quality code - we are practicing TDD using testing frameworks and libraries like Mocha, Chai &amp; sinon</li> <li>Experience in identifying bottlenecks in a large codebase by using a profiler and a debugger</li> <li>Familiar with code-analysis tools and the procedure of static code analysis</li> <li>Experience in using and working in a Linux-based environment daily – you should be comfortable with working in the terminal</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home</li> </ul>"
  },
  {
    "id": "2149aa",
    "title": "Sr. Enterprise Account Executive - AMER",
    "department": "Sales",
    "locations": [
      "United States"
    ],
    "shortlink": "https://apply.workable.com/j/7786B06423",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Cognigy</strong></p><p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p><p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting an overall headcount of 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.</p><p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our sales team.</p><p><br></p><p><strong>Your job: </strong></p><p>To reinvent an industry, we are building out the best team. <strong>That’s why we are looking for you</strong> as a <strong>Sr. Entreprise Account Executive </strong>at Cognigy. As an Account Executive you will work closely with our prospective customers to understand their challenges and goals and identify how Cognigy can help them.<br></p><p><br></p><p><strong>Responsibilities:  </strong></p><ul> <li>Acquiring new enterprise companies from all verticals in the AMER region, F1000/G2000.</li> <li>Building and maintaining an effective pipeline by self-directed prospecting as well as working with internal, Business Development Representative resources</li> <li>Developing, maintaining &amp; reviewing territory plans that outline how you will meet business goals</li> <li>Running full sales cycles from account planning &amp; targeted prospecting through discovery/qualification, contract negotiation &amp; close</li> <li>Taking a consultative, value centric approach with senior executives to map value, develop effective business cases, build ROI models and drive Digital Transformation conversations</li> <li>Preparing, presenting conducting web demos and customer meetings on site as well as the independent and professional preparation of discussions with customer-specific product presentations</li> <li>Coordinating responses to RFPs/RFIs</li> <li>Taking a collaborative approach to working closely with various team members including BDRs, Presales support, Marketing, Product/Finance</li> <li>Using CRM effectively and consistently to track sales cycles/engagement</li> <li>Representing Cognigy at trade fairs or events that are customary in the industry</li> </ul>",
    "requirements": "<ul> <li>An experienced enterprise sales executive with 5+ years selling SaaS. Ideally you have experience in the automation space</li> <li>Someone with a hunter mentality that is passionate about winning and ready/excited to function in state of hypergrowth</li> <li>Confident navigating sales cycles with all management levels (particularly SVP/C-Level)</li> <li>Can balance driving a sales cycle independently while leveraging internal resources for help</li> <li>Organized &amp; disciplined individual who knows how to prioritize and can function well in a remote environment Comfortable leveraging a partner channel to supporting the sales process.</li> <li>A professional communicator with customer-oriented and personable demeanor</li> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome  </li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization </li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers </li> <li>We also offer you an attractive and performance-oriented salary </li> <li>Great benefits, including health/dental/vision and 401k </li> <li>Flexible working hours and ability to work from home in the US</li> </ul><p><br></p><p>#LI-Remote </p>"
  },
  {
    "id": "2149bd",
    "title": "Accounting Manager",
    "department": "Finance",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/D2C2B78479",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Location: </strong>Düsseldorf or remote (Germany and Europe)</p>                    <p><strong>About Cognigy</strong></p>   <p>Cognigy, a market leader in   Conversational AI, powers up enterprise contact centers to exceed customer   expectations, improve agent satisfaction and rapidly respond to market   changes. The Cognigy.AI platform enables next-generation customer service,   with a suite of solutions including Conversational IVR, Smart Self-Service,   and Agent + Assist. Cognigy.AI gives the enterprise what it needs to deliver   always-on, personalized service experiences at scale, on both voice and chat.</p>      <p>Our skilled #CognigyCrew are the   people behind our cutting-edge technology and we are now looking for more   talented people to join our global team.</p><p><br></p>                  <p><strong>Why you’ll love   working at Cognigy: our promise to you</strong></p>   <p>We empower our people to be   successful as part of a diverse, passionate and respectful team who are proud   to be enabling customer and employee service that is loved by everyone.</p>      <p>We do this by challenging each   other to succeed and being enabled to do our best work. Encouraging and   supporting growth is at the heart of our success, founded on a culture of   mutual respect and trust – always! It’s no wonder that the values that   inspire and drive our #CognigyCrew are our 4Ts: </p>   <p><strong>Team</strong>, <strong>Trust</strong>, <strong>Transparency</strong>,   <strong>Technology</strong>.</p><p><br></p>                    <p><strong>Your new role</strong></p>   <ul> <li>As   Accounting Manager you will be responsible for the international accounting   team and work closely with our Director, Financial Controller on the   operational and strategic development of an international finance team.</li> <li>You will be   responsible for and support consolidated monthly, quarterly and annual   financial statements (HGB, IFRS).</li> <li>In addition   to optimizing consolidation processes, tools and standards, you will support   the operational team in the day-to-day business.</li> <li>In   accordance with the transfer price guideline, you coordinate the execution of   intercompany reconciliations and offsets</li> <li>You are the   central contact person and coordinator for accounting topics, external   partners and auditors.</li> </ul>                                                               <a rel=\"nofollow noreferrer noopener\" class=\"external\"></a>",
    "requirements": "<p><strong>About you</strong></p><ul> <li>You have a desire for change, are flexible, like to create structure, are very pragmatic, bring initiative, strong communication skills, the ability to work in a team and have a hands-on mentality</li> <li>Several years of professional experience in accounting - ideally with further training as an (international) accountant - or a successfully completed degree in economics with a focus on accounting.</li> <li>Experience in an international environment and familiar with the consolidation of companies in addition to the operational work in local individual financial statements.</li> <li>You have a structured, solution- and goal-oriented approach and are willing to familiarize yourself with new tasks and systems.</li> <li>Ideally, you have already gained experience in setting up and optimizing processes and introducing financial accounting / ERP systems and are familiar with our ERP system NetSuite.</li> <li>You ideally already have experience in the SaaS industry</li> <li>Knowledge of German law and legislation</li> <li>Good English skills round off your profile and German language skills would be beneficial!</li> </ul><p><br></p><p>Sounds like you? Come and join us!</p>",
    "benefits": "<p><strong>Life at Cognigy: what we offer you</strong></p><p>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome. Our excellent benefits make us a fantastic place to work - these include:</p><ul> <li>Attractive and performance-oriented salary</li> <li>Company pension plan</li> <li>25 days paid leave, plus 5 days floating holidays</li> <li>Discretionary virtual stock options plan, so you can benefit from the company’s success</li> <li>Unique opportunity to help build and shape the company, with little hierarchy</li> <li>Flexible and remote working options</li> <li>Colleague recognition, reward and celebration events</li> <li>Global Employee Assistance Program</li> <li>ClassPass membership, giving you access to a variety of fitness and wellness experiences<a rel=\"nofollow noreferrer noopener\" class=\"external\"></a> </li> <li>Ongoing learning and development opportunities, including LinkedIn Learning</li> </ul>"
  },
  {
    "id": "214a0f",
    "title": "Sr. Account Executive - APAC",
    "department": "Sales",
    "locations": [
      "Sydney, Australia"
    ],
    "shortlink": "https://apply.workable.com/j/074574F57E",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>Job location</strong>: Remote in Australia<br></p><p><strong>Cognigy</strong><br></p>  <p>Cognigy provides a low-code conversational AI platform that can be deployed across a diverse range of applications and geographies — with support for over 120 languages, Cognigy’s key proposition is centred around flexibility: Cognigy.AI is an automation platform that enables enterprises to easily create and operate AI-powered virtual agents to automatically handle calls and chats from customers and employees</p>    <p>Founded in Dusseldorf, Germany, Cognigy retains a strong global presence with offices in Australia, USA and the United Kingdom. Having scaled our global client base to many enterprise grade customers, including Lufthansa, Mobily, BioNTech, Vueling Airlines, Bosch and Daimler, the business is targeting overall headcount growth of 100+ in 2021 and upwards to 250+ over the next 18 months as we are continuing to expand. Cognigy has been able to close significant funding rounds, most recently a Series B round of $44M.  </p>    <p>Our international, smart, and diverse team needs more passionate minds to continue and help us on this journey. We are now looking to expand our sales team.</p>  <p><strong><strong>Responsibilities:</strong></strong></p><p>To reinvent an industry, we are building out the best team. <strong>That’s why we are looking for you</strong><br></p><p> as a <strong>Sr. Entreprise Account Executive </strong>at Cognigy.</p><p> </p><ul> <li>Acquiring new enterprise companies from all verticals in the APAC region</li> <li>Building and maintaining an effective pipeline by self-directed prospecting</li> <li>Developing, maintaining &amp; reviewing territory plans that outline how you will meet business goals</li> <li>Running full sales cycles from account planning &amp; targeted prospecting through discovery/qualification, contract negotiation &amp; close</li> <li>Taking a consultative, value centric approach with senior executives to map value, develop effective business cases, build ROI models and drive Digital Transformation conversations</li> <li>Preparing, presenting conducting web demos and customer meetings on site as well as the independent and professional preparation of discussions with customer-specific product presentations</li> <li>Coordinating and delivering responses to RFPs/RFIs</li> <li>Taking a collaborative approach to working closely with various team members including BDRs, Presales support, Marketing, Product/Finance</li> <li>Using CRM effectively and consistently to track sales cycles/engagement</li> <li>Representing Cognigy at trade fairs or events that are customary in the industry</li> </ul>",
    "requirements": "<ul> <li>You are results driven and have an entrepreneurial mindset</li> <li>You have at least 3-5 years of enterprise sales experience, preferably in the areas of software solutions and/or SaaS</li> <li>You have an established network of enterprise contacts that can be leveraged </li> <li>You can present yourself confidently and empathetically at all management levels (including C-Level) </li> <li>You have strong entrepreneurial skills and have a high affinity for customer acquisition</li> <li>In addition to direct sales, you are also used to acquiring new customers together with our partners and supporting them in the sales process. </li> <li>You shine through your professional communication and negotiation skills as well as your customer-oriented and personable demeanor </li> <li>You work in a very structured, organized manner and you know how to prioritize</li> </ul>                <p></p>",
    "benefits": "<ul> <li>You can expect a very exciting and enormously varied field of activity with many creative possibilities and independent work</li> <li>We are a tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that all employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan</li> <li>We also offer you an attractive salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and remote working option</li> </ul>"
  },
  {
    "id": "215ca9",
    "title": "System Administrator",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/C676E9D4D6",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "",
    "requirements": "",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome</li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers</li> <li>We also offer you an attractive and performance-oriented salary</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization</li> <li>Flexible working hours and ability to work from home/ remote in Germany</li> </ul>"
  },
  {
    "id": "215f6a",
    "title": "Engineering Manager",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/8E15EDA08A",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "description": "<p><strong>About Cognigy</strong> </p><p>Cognigy is revolutionizing the customer service industry by harnessing the most cutting-edge AI technology on the market. Its award-winning solution Cognigy.AI, empowers businesses to deliver exceptional service that is instant, personalized, in any language and on any channel. Cognigy is shaping the future of customer service, creating AI Agents by perfectly combining Generative and Conversational AI to increase customer satisfaction and actively support employees in real-time.   </p><p>Our skilled #CognigyCrew are the people behind our cutting-edge technology and we are now looking for more talented people to join our global team.<br><br></p><p><strong>Why you’ll love working at Cognigy: our promise to you</strong> </p><p>We empower our people to be successful as part of a diverse, passionate and respectful team who are proud to be leading the automation of conversations to make life easier for everyone. </p><p>We do this by challenging each other to succeed and being enabled to do our best work. Encouraging and supporting growth is at the heart of our success, founded on a culture of mutual respect and trust – always! It’s no wonder that the values that inspire and drive our #CognigyCrew are our 4Ts: </p><p><strong>Team</strong>, <strong>Trust</strong>, <strong>Transparency</strong>, <strong>Technology</strong>. </p><p></p><p><strong>Your new role</strong> </p><p>Our engineering department is divided into cross-functional, verticalized development teams, who are focused on delivering continuous improvements, features and developing new products. With strong collaboration from our Support, QA and SRE Teams you will be ensuring the delivery process and the stability of our products.&nbsp;</p><p>With the backing from our Product and People Team, our Director/Architect and VP of Engineering we are constantly looking to overcome new challenges, to innovate, and to ensure the success of our products and satisfaction of our customers.&nbsp;<br></p><p><strong>Engineering Manager</strong></p><p><strong>Job location: on-site in Düsseldorf or remote in Germany</strong></p><p><strong>Your challenge:&nbsp;</strong></p><ul> <li>Managing, mentoring and coaching a team of software engineers&nbsp;</li> <li>Provide resources to improve the engineers’ skills&nbsp;</li> <li>Goal setting and quarterly assessment of team members&nbsp;</li> <li>Training the team according to best practices, to ensure a high-quality product&nbsp;</li> <li>Work to remove obstacles blocking the engineers from achieving their objectives&nbsp;</li> <li>Setting up organization structures and processes for fast flow and scalability&nbsp;</li> <li>Facilitating the communication between engineering disciplines&nbsp;</li> <li>Together with the Product Owner and Tech Lead, define and drive initiatives for long term improvements within the team&nbsp;</li> <li>Human Resource Management related tasks, such as recruitment, remuneration, career planning, long-term vacation planning&nbsp;</li> </ul><p>&nbsp;</p>",
    "requirements": "<p><strong>About you</strong></p><ul><ul> <li>Previous experience leading and managing engineering teams&nbsp;</li> <li>Clear communication and conflict resolution skills&nbsp;</li> <li>Results oriented with a pragmatic mindset&nbsp;</li> <li>You thrive in dynamic environments and can effectively manage shifting priorities&nbsp;</li> <li>Able to communicate technical and non-technical directions&nbsp;</li> <li>Empathetic personality who believes in giving and receiving open feedback&nbsp;</li> <li>You know how to build a supportive and trusting environment within the team&nbsp;</li> <li>You are personable and enjoy interacting with people&nbsp;</li> </ul></ul>",
    "benefits": "<p><strong>Life at Cognigy: what we offer you</strong></p><p>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome. Our excellent benefits make us a fantastic place to work - these include:</p><ul> <li>Attractive and performance-oriented salary</li> <li>Company Pension Scheme</li> <li>25 days paid leave, plus 5 floating days, plus public holidays</li> <li>Unique opportunity to help build and shape the company, with little hierarchy </li> <li>Flexible working options</li> <li>Colleague recognition, reward and celebration events</li> <li>Global Employee Assistance Program</li> <li>ClassPass membership, giving you access to a variety of fitness and wellness experiences</li> <li>Ongoing learning and development opportunities, including LinkedIn Learning</li> <li>One paid ‘Giving Back Day' each year, so you can volunteer for a charity or community activity of your choice</li> <li>Subscription to the Calm app for you plus five friends/family members, giving you access to guided meditation, sleep stories, music, masterclasses, and much more</li> </ul><p></p><p></p><p></p><p><em>Equal Opportunity Employer Statement: Cognigy does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.</em><a rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p>"
  },
  {
    "id": "218ae8",
    "title": "Chief Financial Officer",
    "department": "Finance",
    "locations": [
      "Germany"
    ],
    "shortlink": "https://apply.workable.com/j/1B1EDD45B7",
    "positionType": "Full-time",
    "workplaceType": "on_site",
    "description": "",
    "requirements": "",
    "benefits": ""
  },
  {
    "id": "218b55",
    "title": "HR Administration & Operations",
    "department": "Finance",
    "locations": [
      "Düsseldorf, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/9BC0A777CA",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>About Cognigy</strong></p><p>Cognigy, a market leader in Conversational AI, powers up enterprise contact centers to exceed customer expectations, improve agent satisfaction and rapidly respond to market changes. The Cognigy.AI platform enables next-generation customer service, with a suite of solutions including Conversational IVR, Smart Self-Service, and Agent + Assist. Cognigy.AI gives the enterprise what it needs to deliver always-on, personalized service experiences at scale, on both voice and chat.</p><p>Our skilled #CognigyCrew are the people behind our cutting-edge technology and we are now looking for more talented people to join our global team.</p><p><strong>Why you’ll love working at Cognigy: our promise to you</strong></p><p>We empower our people to be successful as part of a diverse, passionate and respectful team who are proud to be enabling customer and employee service that is loved by everyone.</p><p>We do this by challenging each other to succeed and being enabled to do our best work. Encouraging and supporting growth is at the heart of our success, founded on a culture of mutual respect and trust – always! It’s no wonder that the values that inspire and drive our #CognigyCrew are our 4Ts: <strong>Team</strong>, <strong>Trust</strong>, <strong>Transparency</strong>, <strong>Technology</strong>.<br><br></p><p><strong>Job location: </strong>UK, Germany (in office or remote) </p><p>As an HR &amp; Recruitment Coordinator, you will join our growing People Team at Cognigy, currently operating out Germany (HQ) and London, UK. You will take ownership of the coordination of several recruitment and HR tasks and will be involved in different HR &amp; Recruitment projects, such as employer branding.  </p><p>To be successful in this role you will have a passion for people, have excellent communication skills and have initial experience in supporting HR &amp; recruitment departments.<br><br>  </p><p><strong>Responsibilities</strong><br></p><ul> <li>Provide exceptional candidate &amp; employee experience across the entire employee life cycle </li> <li>Coordinate recruitment &amp; HR tasks – such as interview scheduling, contracts, onboarding, training completion </li> <li>Support with background checks  </li> <li>Support with setting up job requisitions &amp; posting jobs </li> <li>Be involved in several HR projects, such as employer branding</li> <li>Help improve our hiring and HR practices </li> </ul>",
    "requirements": "<ul> <li>Initial experience in HR &amp; Recruitment</li> <li>Understanding of HR policies &amp; processes</li> <li>Strong communication skills </li> <li>Quick learner and experience with HR and recruitment software tools.  </li> <li>Comfortable &amp; excited about a fast-paced environment </li> <li>You are very structured &amp; organised  </li> <li>Fluent in English &amp; ideally in German </li> </ul>",
    "benefits": "<p><strong>Life at Cognigy: what we offer you</strong></p><p>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome. Our excellent benefits make us a fantastic place to work - these include:</p><ul> <li>Attractive and performance-oriented salary</li> <li>Company pension plan</li> <li>Discretionary virtual stock options plan, so you can benefit from the company’s success</li> <li>Unique opportunity to help build and shape the company, with little hierarchy </li> <li>Flexible and remote working options</li> <li>Colleague recognition, reward and celebration events</li> <li>Global Employee Assistance Program</li> <li>ClassPass membership, giving you access to a variety of fitness and wellness experiences</li> <li>Ongoing learning and development opportunities, including LinkedIn Learning</li> </ul><ul> </ul>"
  },
  {
    "id": "219700",
    "title": "Sr. Marketing Manager - North America",
    "department": "Marketing",
    "locations": [
      "United States"
    ],
    "shortlink": "https://apply.workable.com/j/2E3CBEC1C5",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "description": "<p><strong>- Remote in the US -</strong> </p><p>As a Marketing Manager at Cognigy, you’ll be part of the global marketing team and partner closely with US Sales, Product and Customer Success teams to align event-related activities with our business goals. This role takes ownership of all US-based events, planning and executing in-person and virtual events, including conferences, webinars, workshops, executive meetings, and partner events. Driving email, social media, and advertising campaigns that deliver high-quality leads that contribute to team OKRs are also an important part of this role. You’ll report to the head of US marketing on defining a highly effective marketing strategy for different channels and programs. </p><p>The ideal candidate has a proven ability to effectively drive multiple events and campaigns simultaneously from start to finish, be an impressive communicator, organizer and problem solver, possess a can-do attitude, finds the artificial intelligence space exciting, and is looking to make an impact within a rapidly growing global startup.  </p><p><strong><br>What you will be doing:</strong> </p><ul> <li>Plan and execute field events from start to finish: booth logistics and warehousing, promotions and experiences, staffing, sales alignment, lead management</li> <li>Create post-event outreach programs and lead generation campaigns via email, social media, mobile channels</li> <li>Assist with crafting the right strategies of events, campaigns and programs that support Sales, Product Marketing and Partner Marketing initiatives and goals</li> <li>Drive Cognigy’s brand, culture, and vision into field events that delight attendees and drive key business objectives</li> <li>Collaborate with the team to develop account-based events based on business priorities, key markets and customer needs</li> <li>Develop relationships with our customers and work closely with champions, admins, speakers, and user group organizers to co-plan events</li> <li>Budget, track and measure outcomes of field events and play a critical role in the development in our event schedule and field marketing strategy</li> </ul>",
    "requirements": "<ul> <li>Have several years experience in planning events (large and small) for software/SaaS companies </li> <li>Possess outstanding attention to detail and organization; enjoy planning events/trips/experiences and thinking through all the components</li> <li>Are as comfortable behind-the-scenes doing event execution as you are with in-person communication with customers, vendors, and internal stakeholders</li> <li>Are a creative mind who likes bringing new ideas to existing projects and continuously pushes the team to try new things; have a knack for bringing people together</li> <li>Problem-solving is a top quality of yours</li> <li>Are open for business travel several times per quarter</li> <li>Proficiency with Hubspot, Asana and MS Teams (or similar tools) a plus</li> <p><br></p> <p>Could this be you? Apply today.  </p> </ul>",
    "benefits": "<ul> <li>We are an ambitious and international tech company with a great culture, and we make sure that everyone feels welcome  </li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization </li> <li>We believe that our employees should benefit from the company’s success and therefore offer an attractive virtual stock options plan to top performers </li> <li>We also offer you an attractive and performance-oriented salary </li> <li>Great benefits, including health/dental/vision and 401k</li> <li>The opportunity to help build this company with flat hierarchies and the possibility to shape the organization </li> <li>Flexible working hours and ability to work from home/ remote in the US </li> </ul>"
  }
]