[
  {
    "id": "215f6a",
    "title": "Engineering Manager",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/8E15EDA08A",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "requirements": "<p><strong>About you</strong></p><ul> <li> <strong>Proven Leadership Experience</strong> – You have a strong track record of leading and managing engineering teams, driving both technical excellence and team growth.</li> <li> <strong>Exceptional Communication Skills</strong> – You can articulate technical and non-technical concepts clearly, ensuring alignment across teams and stakeholders.</li> <li> <strong>Strong Conflict Resolution &amp; Feedback Culture</strong> – You handle challenges with diplomacy, foster open discussions, and create a culture where feedback is valued and constructive.</li> <li> <strong>Results-Driven &amp; Pragmatic</strong> – You focus on achieving impactful outcomes, balancing high standards with a practical, solution-oriented mindset.</li> <li> <strong>Thrives in Fast-Paced Environments</strong> – You excel in dynamic settings, adapting to shifting priorities while maintaining clarity and focus.</li> <li> <strong>Empathetic &amp; People-Centric</strong> – You genuinely care about your team’s well-being, fostering trust, collaboration, and a positive work environment.</li> <li> <strong>Supportive &amp; Team-Oriented</strong> – You know how to build a culture of trust, ensuring engineers feel empowered, supported, and motivated to do their best work.</li> <li> <strong>Personable &amp; Approachable</strong> – You enjoy engaging with people, building strong relationships, and creating a workplace where everyone feels valued.</li> </ul>"
  },
  {
    "id": "2e3f06",
    "title": "Senior Full-stack Software Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/90AF861F91",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li> <strong>Experienced Full-Stack Developer</strong> – Several years of hands-on experience in full-stack software development, building scalable and efficient applications.</li> <li> <strong>Containerization &amp; Debugging</strong> – Proficient in working with containers and debugging containerized applications.</li> <li> <strong>Linux Proficiency</strong> – Comfortable working in a Linux-based environment.</li> <li> <strong>Frontend Expertise</strong> – Strong experience with modern frontend frameworks such as React.js or Vue.js, including state management libraries like Redux and CSS-in-JS solutions.</li> <li> <strong>Backend Development</strong> – Skilled in building backend applications using frameworks like Node.js or Ruby on Rails.</li> <li> <strong>Design Mindset</strong> – A keen eye for good design and UI/UX principles—padding and margin aren’t just CSS properties to you.</li> <li> <strong>Database Knowledge</strong> – Familiarity with MongoDB or similar NoSQL databases; SQL experience is a plus.</li> <li> <strong>Real-Time Communication</strong> – Experience working with real-time communication protocols such as WebSocket or WebRTC.</li> <li> <strong>High-Quality Code &amp; Testing</strong> – Passion for writing clean, well-structured, and thoroughly tested code.</li> <li> <strong>Adaptable &amp; Growth-Oriented</strong> – Open to working with various programming languages and continuously learning new technologies.</li> <li> <strong>Strong Communicator</strong> – Ability to present new ideas and concepts clearly, including to management and stakeholders.</li> <li> <strong>Independent &amp; Collaborative</strong> – Capable of working autonomously while thriving in a team-oriented environment.</li> <li> <strong>Incident Response &amp; Decision Making</strong> – You stay calm under pressure, make decisions with urgency when necessary, and are comfortable being on call for emergencies when needed.</li> </ul>"
  },
  {
    "id": "2ee130",
    "title": "Sales Engineer",
    "department": "Sales Engineering (Presales)",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/1649C41173",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><p>Are you a tech-savvy professional with a knack for delivering captivating demos? Do you thrive in the world of enterprise software, especially in contact center or automation technologies? If so, we have an exciting opportunity for you!</p><p>Key Requirements:</p><ul> <li> <strong>Consulting &amp; Sales Engineering Expertise:</strong> Leverage your experience in roles like consultant, sales engineer, or presales to provide insightful and engaging demonstrations.</li> <li> <strong>Enterprise Software Proficiency:</strong> Bring your background in the enterprise software space, particularly with contact center or automation technologies, to the table.</li> <li> <strong>Programming Skills:</strong> Utilize your JavaScript programming/scripting experience, essential for presales and enablement services. Knowledge of Java, Python, or similar languages is a plus.</li> <li> <strong>Low Code &amp; Conversational AI Experience: </strong>Experience presenting conversational AI and generative AI technologies.</li> <li> <strong>Contact Center Knowledge: </strong>Understanding contact center technology (SIP and typical contact center components such as SBCs, ACD, ASR, TTS, etc.). Experience with conversation design, IVR design or chatbot design.</li> <li> <strong>Presentation Prowess:</strong> Be a confident and engaging presenter, capable of captivating your audience.</li> <li> <strong>Creative &amp; Design Skills:</strong> Experience with video editing, Photoshop, or similar tools is a valuable asset.</li> <li> <strong>Tech Enthusiast: </strong>Demonstrate confidence in speaking about and dealing with technology, with an ability to quickly learn new technologies.</li> <li> <strong>Technical Expertise:</strong> Have a deep understanding of Cognigy, conversational AI technologies, NLU/NLP, and related software technologies, including UI/UX.</li> <li> <strong>Sales Acumen:</strong> Effectively communicate complex technology in an easy-to-understand manner, build rapport with customers, and showcase Cognigy’s capabilities and value proposition.</li> <li> <strong>Communication &amp; Collaboration:</strong> Exhibit excellent communication skills, tailored to your audience, and the ability to collaborate effectively with cross-functional teams (<strong>Must be fluent in German and English)</strong> </li> </ul><p></p><p>If you’re ready to take on a role that combines technical knowledge with sales finesse, we’d love to hear from you!</p>"
  },
  {
    "id": "34466a",
    "title": "Senior Backend Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany",
      "Berlin, Berlin, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/FA3AB1C5D2",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li> <strong>Experienced Backend Engineer</strong> – You bring 5+ years of backend software development experience, building reliable and scalable systems in production environments.</li> <li> <strong>Container-Native</strong> – You’re comfortable working with containerized microservices, and debugging in Docker or similar environments is second nature.</li> <li> <strong>Linux Pro</strong> – You thrive in Linux-based environments and are at home in the terminal.</li> <li> <strong>Modern Backend Stack</strong> – Strong experience with Node.js and TypeScript. Bonus points if you’ve worked with Python or Golang — you're comfortable picking up new languages as needed.</li> <li> <strong>Database Fluent</strong> – Solid working knowledge of databases like MongoDB, PostgreSQL, and Redis, and understanding their strengths in different scenarios.</li> <li> <strong>Messaging Systems Familiarity</strong> – You’ve worked with message brokers like RabbitMQ, NATS, or similar tools to build distributed systems.</li> <li> <strong>Quality-Driven</strong> – Writing clean, well-tested, and maintainable code is a natural part of your workflow.</li> <li> <strong>Growth-Oriented</strong> – You’re curious and constantly learning, open to new technologies, tools, and ways of working.</li> <li> <strong>Proactive &amp; Impactful</strong> – You don’t just write code — you actively look for ways to improve systems, processes, and performance.</li> <li> <strong>Resilient &amp; Adaptable</strong> – You’re comfortable with ambiguity, stay focused under pressure, and adapt quickly as things evolve.</li> <li> <strong>Incident Response &amp; Decision Making</strong> – You stay calm under pressure, make decisions with urgency when necessary, and are comfortable being on call for emergencies when needed.</li> </ul>"
  },
  {
    "id": "3942cf",
    "title": "Senior Customer Success Manager",
    "department": "Customer Success",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/5B2018CFFE",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p> <strong>About you</strong></p><p> </p><ul> <li>At least <strong>5 years of experience in the software industry as a Customer Success Manager</strong>, with a proven track record of driving measurable business outcomes for customers, such as increased retention rates and product adoption.</li> <li>A deep understanding of what constitutes strategic business value in the <strong>software industry</strong>, including familiarity with industry benchmarks and the ability to guide customers in setting and achieving ROI-driven objectives</li> <li>Exceptional communication skills, both written and oral, with the ability to articulate complex solutions clearly to customers. Must be adept at building rapport and fostering collaborative relationships.</li> <li>Empathetic to customer needs with the ability to employ a user-centric approach to ensure a seamless customer experience.</li> <li>An analytical and structured approach to problem-solving, with experience using CRM platforms, Customer Success tools and data analysis software to prioritize and track value-driving activities.</li> <li>Openness to travel up to 30% of the time within Europe, including preparedness for occasional international conferences or meetings.</li> <li>A robust understanding of business and IT processes, particularly SaaS models, with a keen eye for identifying opportunities for process optimization.</li> <li><strong>Fluency in&nbsp;German and English&nbsp;is essential</strong></li> <li>A personal alignment with our company’s values and culture, contributing positively to our work environment.</li> <li>Motivated individual with a genuine interest in AI technology who is passionate about seeing AI used to generate business outcomes.</li> </ul><p> </p><p><strong>Growth Potential</strong></p><p>At Cognigy we are committed to your professional growth. This role offers significant opportunities for career development, including access to ongoing training, and involvement in high-impact projects allowing you to showcase and advance your unique skills and experience.</p>"
  },
  {
    "id": "395d54",
    "title": "QA Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/E0C8E276C2",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li>Experience in testing of web applications and explorative testing</li> <li>Familiarity with agile software development methodologies</li> <li>Familiarity with test automation and testing tools</li> <li>Experience with at least one Code Versioning System (like Git)</li> <li>Understanding of the SDLC and SDTC</li> <li>Self-driven, motivated, ready to learn and adapt</li> <li>Good communicator with good English language skills</li> <li>Consistent, structured, analytical solver</li> <li>Ability to work as part of a team</li> <li>Advantage: having an ISTQB certificate</li> </ul><p><br> <br> Sounds like you? Come and join us!</p>"
  },
  {
    "id": "39d00c",
    "title": "Staff Software Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/49728C082A",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul><ul> <li> <strong>Backend Engineer</strong> – With 8+ years of hands-on experience, you’ve built, scaled, and maintained backend systems that run reliably in production.</li> <li> <strong>Production-Grade Kubernetes Expertise</strong> – You’ve spent 5+ years deploying, running, and monitoring containerized applications in Kubernetes environments — you're deeply familiar with real-world operational challenges and how to solve them.</li> <li> <strong>Language-Agnostic Technologist</strong> – Whether it's TypeScript, Python, or Golang, you're fluent across multiple languages and, more importantly, you've mastered the underlying software engineering principles. Adopting a new language is just a matter of syntax.</li> <li> <strong>Deep Systems Knowledge</strong> – You're an expert in at least three of the following: MongoDB, Redis, PostgreSQL, RabbitMQ, NATS — and you know how to tune and optimize them for high-performance and stability in production.</li> <li> <strong>Testing Champion</strong> – You design and improve automated tests as an integral part of the development process, ensuring quality and confidence in every release.</li> <li> <strong>Ownership Mindset</strong> – You don’t just build features — you take full responsibility for what you ship, including fixing production issues whenever they arise. Reliability matters to you.</li> <li> <strong>Architectural Visionary</strong> – You’re capable of designing and evolving the architecture of large-scale product features. You can communicate your vision clearly to Product Managers and defend your design decisions with stakeholders.</li> <li> <strong>Strong Communicator &amp; Influencer</strong> – You bring ideas to life through clear, concise communication — whether presenting to leadership or collaborating with cross-functional teams, you can align others to your vision.</li> <li> <strong>Autonomous &amp; Impact-Oriented</strong> – You thrive in complex environments, working independently across multiple codebases, and consistently deliver high-quality, meaningful features that drive product value.</li> <li> <strong>Incident Response &amp; Decision Making</strong> – You stay calm under pressure, make decisions with urgency when necessary, and are comfortable being on call for emergencies when needed.<br><br><br><br>Sounds like you? Come and join us!</li> </ul></ul>"
  },
  {
    "id": "4298e5",
    "title": "Senior Account Executive - DACH",
    "department": "Sales",
    "locations": [
      "Germany",
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/14DEE080C0",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li><strong>You are an experienced Enterprise Sales Executive with a proven track record of success in selling SaaS within the wider Contact Center or Conversational AI environment</strong></li> <li>You have a hunter mentality and are passionate about winning and being part of an exciting company in a hyper-growth phase</li> <li>You are confident navigating sales cycles with all management levels (particularly SVP/C-Level)</li> <li>Organization and prioritizing are at the heart of everything you do and you are disciplined and function well in a remote environment</li> <li>What is a salesperson without professional communication skills, and a customer-centric, personable demeanor?!</li> <li>You can balance driving a sales cycle independently while leveraging internal resources</li> <li>You are comfortable leveraging a partner channel to support the sales process</li> <li>Fluent in German and English</li> </ul><p></p>"
  },
  {
    "id": "487ed7",
    "title": "Technical Support Specialist - US (Product Support)",
    "department": "Customer Support",
    "locations": [
      "Dallas, Texas, United States"
    ],
    "shortlink": "https://apply.workable.com/j/4B4B5DB333",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "requirements": "<p><strong>About you:</strong>&nbsp;</p><ul> <li> <strong>Proven Product Support Experience</strong> – 3+ years of experience as a Product Support Engineer or in a similar technical support role.</li> <li> <strong>Technical Expertise</strong> – Hands-on experience with Windows and Linux, with a solid understanding of computer systems, software, and technical products.</li> <li> <strong>Software &amp; Systems Knowledge</strong> – Strong familiarity with software development concepts, databases, and system design.</li> <li> <strong>Customer-Centric Mindset</strong> – Understanding of customer service best practices, with a proactive and solutions-driven approach to support.</li> <li> <strong>Excellent Communication &amp; Team Fit</strong> – Outgoing and approachable personality, capable of thriving in a collaborative, social team environment.</li> <li> <strong>Can-Do Attitude</strong> – A proactive problem-solver with a hands-on, solution-oriented mindset.</li> <li> <strong>Effective Technical Support Delivery</strong> – Ability to provide clear, step-by-step technical assistance in both written and verbal formats.</li> <li> <strong>Analytical &amp; Troubleshooting Skills</strong> – Strong problem-solving abilities with a keen eye for diagnosing and resolving technical issues efficiently.</li> <li> <strong>Cloud &amp; Programming Knowledge</strong> – Experience with cloud-based technologies and familiarity with basic programming languages.</li> </ul>"
  },
  {
    "id": "48c125",
    "title": "Senior Account Executive - US (NY, NJ, ME, RI, VT)",
    "department": "Sales",
    "locations": [
      "New York, New York, United States",
      "New Jersey, United States",
      "Maine, United States",
      "Rhode Island, United States",
      "Vermont, United States"
    ],
    "shortlink": "https://apply.workable.com/j/4C5A5C01FE",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul><ul> <li>5+ years of enterprise SaaS sales experience, with a successful track record selling to Fortune 500 companies</li> <li>3+ years of CCaaS, CAI, or AI/Automation sales experience</li> <li>Technical sales experience in CCaaS, CAI, AI/Automation is a plus</li> <li>Experience working in or selling through a partner/channel model; you're comfortable influencing without direct control</li> <li>Proven ability to close $1M+ in annual quota with individual deal sizes in the 6- and 7-figure range</li> <li>Exceptional at managing complex, multi-threaded sales cycles with VP and C-level stakeholders</li> <li>A self-starter who can independently drive deals forward while embracing a team-oriented sales motion</li> <li>Strong business acumen and a consultative mindset; you bring insight and structure to every customer conversation</li> <li>Comfortable working in a fast-paced, high-growth environment</li> </ul></ul><p></p>"
  },
  {
    "id": "48c823",
    "title": "Senior Account Executive - US (GA, MS, LA, TN, AL, NM)",
    "department": "Sales",
    "locations": [
      "United States",
      "Georgia, United States",
      "Mississippi, United States",
      "Louisiana, United States",
      "Tennessee, United States",
      "Alabama, United States"
    ],
    "shortlink": "https://apply.workable.com/j/1A5E45C003",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul><ul> <li>5+ years of enterprise SaaS sales experience, with a successful track record selling to Fortune 500 companies</li> <li>3+ years of CCaaS, CAI, or AI/Automation sales experience</li> <li>Technical sales experience in CCaaS, CAI, AI/Automation is a plus</li> <li>Experience working in or selling through a partner/channel model; you're comfortable influencing without direct control</li> <li>Proven ability to close $1M+ in annual quota with individual deal sizes in the 6- and 7-figure range</li> <li>Exceptional at managing complex, multi-threaded sales cycles with VP and C-level stakeholders</li> <li>A self-starter who can independently drive deals forward while embracing a team-oriented sales motion</li> <li>Strong business acumen and a consultative mindset; you bring insight and structure to every customer conversation</li> <li>Comfortable working in a fast-paced, high-growth environment</li> </ul></ul><p></p>"
  },
  {
    "id": "495277",
    "title": "Technical Project Manager - US",
    "department": "Professional Services",
    "locations": [
      "Dallas, Texas, United States"
    ],
    "shortlink": "https://apply.workable.com/j/59F2C6887A",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "requirements": "<p> <strong>About you</strong></p><ul> <li>Minimum <strong>5+ years of project management experience</strong>, delivering enterprise-level projects—preferably in <strong>Conversational AI</strong> or <strong>Contact Center</strong> environments. </li> <li> Proven track record managing <strong>multiple, simultaneous projects</strong> in a <strong>professional services or consulting</strong> setting, using both <strong>Agile and Waterfall</strong> methodologies. </li> <li>Comfortable working with technical teams and understanding core concepts of <strong>Conversational AI</strong> to independently build and manage project plans. </li> <li>Experience serving as the <strong>primary client contact</strong>, with strong stakeholder management skills across departments and executive levels. </li> <li>Skilled in developing, executing, and maintaining <strong>detailed project plans</strong> aligned with Statements of Work (SOW), including timelines, milestones, and deliverables. </li> <li> Proactive in identifying risks, managing escalations, and implementing <strong>contingency plans</strong> to ensure project stability. </li> <li>Highly <strong>organized and detail-oriented</strong>, with strong time management and the ability to maintain momentum across diverse teams. </li> <li> Proficient in project management tools such as <strong>MS Project, Jira, Asana,</strong> or <strong>Smartsheet</strong>.</li> <li><strong>Applicants must be authorized to work in the United States without the need for employer sponsorship now or in the future. We are unable to offer visa sponsorship for this position.</strong></li> </ul><p></p>"
  },
  {
    "id": "49ba49",
    "title": "Sales Engineer - US",
    "department": "Sales Engineering (Presales)",
    "locations": [
      "Dallas, Texas, United States"
    ],
    "shortlink": "https://apply.workable.com/j/A4D51C408E",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><p>Are you a tech-savvy professional with a knack for delivering captivating demos? Do you thrive in the world of enterprise software, especially in contact center or automation technologies? If so, we have an exciting opportunity for you!</p><p>Key Requirements:</p><ul> <li> <strong>Consulting &amp; Sales Engineering Expertise:</strong> Leverage your experience in roles like consultant, sales engineer, or presales to provide insightful and engaging demonstrations.</li> <li> <strong>Enterprise Software Proficiency:</strong> Bring your background in the enterprise software space, particularly with contact center or automation technologies, to the table.</li> <li> <strong>Programming Skills:</strong> Utilize your JavaScript programming/scripting experience, essential for presales and enablement services. Knowledge of Java, Python, or similar languages is a plus.</li> <li> <strong>Low Code &amp; Conversational AI Experience: </strong>Experience presenting conversational AI and generative AI technologies.</li> <li> <strong>Contact Center Knowledge: </strong>Understanding contact center technology (SIP and typical contact center components such as SBCs, ACD, ASR, TTS, etc.). Experience with conversation design, IVR design or chatbot design.</li> <li> <strong>Presentation Prowess:</strong> Be a confident and engaging presenter, capable of captivating your audience.</li> <li> <strong>Creative &amp; Design Skills:</strong> Experience with video editing, Photoshop, or similar tools is a valuable asset.</li> <li> <strong>Tech Enthusiast: </strong>Demonstrate confidence in speaking about and dealing with technology, with an ability to quickly learn new technologies.</li> <li> <strong>Technical Expertise:</strong> Have a deep understanding of Cognigy, conversational AI technologies, NLU/NLP, and related software technologies, including UI/UX.</li> <li> <strong>Sales Acumen:</strong> Effectively communicate complex technology in an easy-to-understand manner, build rapport with customers, and showcase Cognigy’s capabilities and value proposition.</li> <li> <strong>Communication &amp; Collaboration:</strong> Exhibit excellent communication skills, tailored to your audience, and the ability to collaborate effectively with cross-functional teams</li> <li><strong>Applicants must be authorized to work in the United States without the need for employer sponsorship now or in the future. We are unable to offer visa sponsorship for this position.</strong></li> </ul><p></p><p>If you’re ready to take on a role that combines technical knowledge with sales finesse, we’d love to hear from you!</p><p></p>"
  },
  {
    "id": "49c2dd",
    "title": "Software Engineer (DevEx)",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/A78669799E",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<h3>About you</h3><ul> <li> 5+ years of experience in backend software engineering, preferably in a platform or DevOps role </li> <li> Deep experience with <strong>Kubernetes</strong>, <strong>Helm</strong>, <strong>Terraform</strong>, and modern infrastructure-as-code practices </li> <li> Proficiency in <strong>backend development</strong> using <strong>TypeScript/Node.js</strong>, Python, or Golang </li> <li> Strong <strong>Linux terminal skills</strong> and experience with <strong>container debugging</strong> </li> <li> Familiarity with <strong>CI/CD systems</strong> (e.g., GitHub Actions, Jenkins) and pipeline optimization techniques </li> <li> Experience with security and compliance tooling like <strong>Snyk</strong>, <strong>Vanta</strong>, or equivalent </li> <li> Hands-on knowledge of cloud platforms (Azure, AWS preferred) </li> <li> Proven ability to collaborate, mentor, and lead process improvements across engineering teams </li> <li> Observability expertise (Grafana, Sentry, Kibana) and a systems-thinking mindset </li> <li> Comfortable making architectural decisions and owning secure, reliable developer infrastructure</li> </ul><ul><li> <strong>Incident Response &amp; Decision Making</strong> – You stay calm under pressure, make decisions with urgency when necessary, and are comfortable being on call for emergencies when needed.</li></ul>"
  },
  {
    "id": "49c347",
    "title": "MLOps Engineer",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/1F4C0C60B7",
    "positionType": "Not specified",
    "workplaceType": "remote",
    "requirements": "<h3>About you</h3><ul> <li> Hands-on experience running production <strong>ML or LLM workloads in Kubernetes</strong> </li> <li> Familiarity with distributed ML frameworks such as <strong>KubeRay, Ray Serve, or similar</strong> </li> <li> Deep understanding of <strong>Kubernetes internals</strong>, especially GPU scheduling, autoscaling, and multi-tenant environments </li> <li> Proficiency with <strong>CI/CD systems for ML models</strong>, and versioned deployment strategies </li> <li> Strong experience with <strong>cloud platforms</strong> (AWS, GCP, or Azure), <strong>networking</strong>, and <strong>security</strong> best practices </li> <li> Skilled in <strong>monitoring and observability</strong> for ML workloads (e.g., Prometheus, Grafana) </li> <li> Passion for <strong>automation</strong>, <strong>performance tuning</strong>, and <strong>cost optimization</strong> for LLM workloads </li> <li> Clear communicator and proactive team player who thrives in fast-paced, cross-functional environments </li> <li> MLOps or DevOps certifications (nice to have)</li> </ul>"
  },
  {
    "id": "4a032d",
    "title": "Conversation Designer - US",
    "department": "Professional Services",
    "locations": [
      "Plano, Texas, United States"
    ],
    "shortlink": "https://apply.workable.com/j/BCFC45964C",
    "positionType": "Full-time",
    "workplaceType": "hybrid",
    "requirements": "<p><strong>About You:</strong></p><ul> <li>3+ years of experience as a conversation designer, UX designer, or similar role </li> <li>Strong command of English (spoken and written) </li> <li>Proven experience creating user-centric conversational experiences across modalities </li> <li>Familiarity with conversational design tools (ideally Cognigy.AI) and &nbsp;experience utilizing Generative AI in conversation design</li> <li>You have a proven track-record of building great user experiences on different modalities</li> <li>You are enthusiastic about technology and familiar with current trends and hands-on experience enterprise software. (You don’t need to be programmer, but you should not be scared when you see code.)</li> <li>Comfortable working with APIs, data analysis, and understanding technical documentation </li> <li>A generalist mindset with adaptability and a passion for innovation </li> <li>Strong communication, collaboration, and problem-solving skills </li> <li>Customer-focused, solution-oriented, and skilled in navigating interpersonal dynamics</li> <li><strong>Applicants must be authorized to work in the United States without the need for employer sponsorship now or in the future. We are unable to offer visa sponsorship for this position.</strong></li> </ul>"
  },
  {
    "id": "4abfee",
    "title": "Senior Solutions Architect - EMEA",
    "department": "Professional Services",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/03BFB830E4",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li>Minimum of 5 years in a similar role within Conversational AI, SaaS, or enterprise software industries, focusing on high-level individual contributions and advanced technical implementations.</li> <li>Mastery in Python, Java, Node.js, APIs, SDKs, and cloud-based platforms. Proven experience with Cognigy or equivalent Conversational AI platforms.</li> <li>Demonstrated ability to resolve complex technical challenges with scalable and innovative solutions.</li> <li>Strong capability to align technical solutions with business objectives and deliver measurable outcomes.</li> <li>Exceptional ability to communicate technical concepts effectively to both technical and non-technical stakeholders.</li> <li><strong>Must be fluent in German (minimum C1 level) and English</strong></li> </ul><p></p>"
  },
  {
    "id": "4c9b5d",
    "title": "Senior Account Executive - US (UT, AK, HI, OR, CO, WY)",
    "department": "Sales",
    "locations": [
      "United States",
      "Colorado, United States",
      "Alaska, United States",
      "Oregon, United States",
      "Wyoming, United States",
      "Utah, United States"
    ],
    "shortlink": "https://apply.workable.com/j/D1201D81AE",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul><ul> <li>5+ years of enterprise SaaS sales experience, with a successful track record selling to Fortune 500 companies</li> <li>3+ years of CCaaS, CAI, or AI/Automation sales experience</li> <li>Technical sales experience in CCaaS, CAI, AI/Automation is a plus</li> <li>Experience working in or selling through a partner/channel model; you're comfortable influencing without direct control</li> <li>Proven ability to close $1M+ in annual quota with individual deal sizes in the 6- and 7-figure range</li> <li>Exceptional at managing complex, multi-threaded sales cycles with VP and C-level stakeholders</li> <li>A self-starter who can independently drive deals forward while embracing a team-oriented sales motion</li> <li>Strong business acumen and a consultative mindset; you bring insight and structure to every customer conversation</li> <li>Comfortable working in a fast-paced, high-growth environment</li> </ul></ul><p></p>"
  },
  {
    "id": "4e08ea",
    "title": "Site Reliability Engineer (SRE)",
    "department": "Engineering",
    "locations": [
      "Düsseldorf, North Rhine-Westphalia, Germany"
    ],
    "shortlink": "https://apply.workable.com/j/10437870DA",
    "positionType": "Full-time",
    "workplaceType": "remote",
    "requirements": "<p><strong>About you</strong></p><ul> <li> <strong>Kubernetes &amp; Containerization Expertise</strong> – You have several years of experience running containers in production, including building Kubernetes clusters from the ground up. You’re also experienced with managed Kubernetes services like AWS EKS, Azure AKS, or Google GKE.</li> <li> <strong>Infrastructure Auto-Scaling</strong> – You know how to leverage tools like the Horizontal Pod Autoscaler and Cluster Autoscaler to ensure seamless scaling and performance.</li> <li> <strong>Cloud Proficiency – </strong>You have hands-on experience with major cloud platforms like AWS, Microsoft Azure or GCP.</li> <li> <strong>Strong Networking &amp; Security Knowledge</strong> – You understand concepts like VPCs, subnets, internet gateways, and web security best practices.</li> <li> <strong>Passion for Automation</strong> – You have multiple years of experience with CI/CD systems (e.g., Jenkins, GitLab) and believe in automating whenever possible.</li> <li> <strong>Infrastructure as Code Enthusiast</strong> – You’re proficient with tools like Terraform, Helm, and Flux for managing infrastructure and deployments.</li> <li> <strong>Programming Skills</strong> – You have expertise in one or more programming languages such as Golang, Python, Ruby, JavaScript, Java, or Perl.</li> <li> <strong>Hands-on with Key Technologies</strong> – You’re familiar with Docker, Kubernetes, Message brokers, NoSQL and SQL databases and other core technologies.</li> <li> <strong>Monitoring &amp; Observability</strong> – You have experience with monitoring tools like Prometheus, Grafana, and the ELK Stack, ensuring system reliability and performance.</li> <li> <strong>Proactive &amp; Solution-Oriented Mindset</strong> – You anticipate scaling needs, take full ownership of challenges, and apply a systematic approach to problem-solving.</li> <li> <strong>Incident Response &amp; Decision Making</strong> – You stay calm under pressure, make decisions with urgency when necessary, and are comfortable being on call for emergencies.</li> <li> <strong>Team-Oriented &amp; Globally Minded</strong> – You’re eager to collaborate in an international, dynamic, and highly motivated team, contributing to the growth of Cognigy.AI.   </li> </ul>"
  }
]